[
  {
    "id": "20000100",
    "name": "Bulbasaur",
    "description": "It can be seen napping in bright sunlight. There is a seed on its back. By soaking up the sun’s rays, the seed grows progressively larger."
  },
  {
    "id": "20000200",
    "name": "Ivysaur",
    "description": "There is a bud on this Pokémon’s back. To support its weight, It’s legs and trunk grow thick and strong. If it starts spending more time lying in the sunlight, it’s a sign that the bud will bloom into a large flower soon."
  },
  {
    "id": "20000301",
    "name": "Venusaur",
    "description": "There is a large flower on It’s back. The flower is said to take on vivid colors if it gets plenty of nutrition and sunlight. The flower’s aroma soothes the emotions of people."
  },
  {
    "id": "20000400",
    "name": "Charmander",
    "description": "The flame that burns at the tip of its tail is an indication of its emotions. The flame wavers when It is enjoying itself. If the Pokémon becomes enraged, the flame burns fiercely."
  },
  {
    "id": "20000500",
    "name": "Charmeleon",
    "description": "It mercilessly destroys its foes using its sharp claws. If it encounters a strong foe, it turns aggressive. In this excited state, the flame at the tip of its tail flares with a bluish white color."
  },
  {
    "id": "20000600",
    "name": "Charizard",
    "description": "It flies around the sky in search of powerful opponents. It breathes fire of such great heat that it melts anything. However, it never turns its fiery breath on any opponent weaker than itself."
  },
  {
    "id": "20000700",
    "name": "Squirtle",
    "description": "It’s shell is not merely used for protection. The shell’s rounded shape and the grooves on its surface help minimize resistance in water, enabling this Pokémon to swim at high speeds."
  },
  {
    "id": "20000800",
    "name": "Wartortle",
    "description": "Its tail is large and covered with a rich, thick fur. The tail becomes increasingly deeper in color as It ages. The scratches on its shell are evidence of this Pokémon’s toughness as a battler."
  },
  {
    "id": "20000900",
    "name": "Blastoise",
    "description": "It has water spouts that protrude from its shell. The water spouts are very accurate. They can shoot bullets of water with enough accuracy to strike empty cans from a distance of over 160 feet."
  },
  {
    "id": "20001300",
    "name": "Weedle",
    "description": "It has an extremely acute sense of smell. It is capable of distinguishing its favorite kinds of leaves from those it dislikes just by sniffing with its big red proboscis (nose)."
  },
  {
    "id": "20001400",
    "name": "Kakuna",
    "description": "It remains virtually immobile as it clings to a tree. However, on the inside, it is extremely busy as it prepares for its coming evolution. This is evident from how hot the shell becomes to the touch."
  },
  {
    "id": "20001500",
    "name": "Beedrill",
    "description": "It is extremely territorial. No one should ever approach its nest—this is for their own safety. If angered, they will attack in a furious swarm."
  },
  {
    "id": "20001600",
    "name": "Pidgey",
    "description": "It has an extremely sharp sense of direction. It is capable of unerringly returning home to its nest, however far it may be removed from its familiar surroundings."
  },
  {
    "id": "20001800",
    "name": "Pidgeot",
    "description": "This Pokémon has a dazzling plumage of beautifully glossy feathers. Many Trainers are captivated by the striking beauty of the feathers on its head, compelling them to choose It as their Pokémon."
  },
  {
    "id": "20001901",
    "name": "Rattata",
    "description": "Its incisors grow continuously throughout its life. If its incisors get too long, this Pokémon becomes unable to eat, and it starves to death."
  },
  {
    "id": "20002001",
    "name": "Raticate",
    "description": "People say that it fled from its enemies by using its small webbed hind feet to swim from island to island in Alola."
  },
  {
    "id": "20002400",
    "name": "Arbok",
    "description": "The latest research has determined that there are over 20 possible arrangements of the patterns on its stomach."
  },
  {
    "id": "20002500",
    "name": "Pikachu",
    "description": "Its nature is to store up electricity. Forests where nests of It live are dangerous, since the trees are so often struck by lightning."
  },
  {
    "id": "20002601",
    "name": "Raichu",
    "description": "As electricity builds up inside its body, it becomes more aggressive. One theory is that the electricity buildup is actually causing stress."
  },
  {
    "id": "20002661",
    "name": "Raichu",
    "description": "It focuses psychic energy into its tail and rides it like it’s surfing. Another name for this Pokémon is “hodad.”"
  },
  {
    "id": "20002861",
    "name": "Sandslash",
    "description": "It runs across snow-covered plains at high speeds. It developed thick, sharp claws to plow through the snow."
  },
  {
    "id": "20002900",
    "name": "Nidoran♀",
    "description": "It has barbs that secrete a powerful poison. They are thought to have developed as protection for this small-bodied Pokémon. When enraged, it releases a horrible toxin from its horn."
  },
  {
    "id": "20003000",
    "name": "Nidorina",
    "description": "When It are with their friends or family, they keep their barbs tucked away to prevent hurting each other. This Pokémon appears to become nervous if separated from the others."
  },
  {
    "id": "20003100",
    "name": "Nidoqueen",
    "description": "It’s body is encased in extremely hard scales. It is adept at sending foes flying with harsh tackles. This Pokémon is at its strongest when it is defending its young."
  },
  {
    "id": "20003500",
    "name": "Clefairy",
    "description": "They’re popular, but they’re rare. Trainers who show them off recklessly may be targeted by thieves."
  },
  {
    "id": "20003900",
    "name": "Jigglypuff",
    "description": "Recordings of It’s strange lullabies can be purchased from department stores. These CDs can be found near the bedding area."
  },
  {
    "id": "20004101",
    "name": "Zubat",
    "description": "It has no eyeballs, so it can’t see. It checks its surroundings via the ultrasonic waves it emits from its mouth."
  },
  {
    "id": "20004200",
    "name": "Golbat",
    "description": "Every once in a while, you’ll see a It that’s missing some fangs. This happens when hunger drives it to try biting a Steel-type Pokémon."
  },
  {
    "id": "20004501",
    "name": "Vileplume",
    "description": "It’s toxic pollen triggers atrocious allergy attacks. That’s why it is advisable never to approach any attractive flowers in a jungle, however pretty they may be."
  },
  {
    "id": "20004800",
    "name": "Venonat",
    "description": "It is said to have evolved with a coat of thin, stiff hair that covers its entire body for protection. It possesses large eyes that never fail to spot even minuscule prey."
  },
  {
    "id": "20004900",
    "name": "Venomoth",
    "description": "It is nocturnal—it is a Pokémon that only becomes active at night. Its favorite prey are small insects that gather around streetlights, attracted by the light in the darkness."
  },
  {
    "id": "20005161",
    "name": "Dugtrio",
    "description": "Its metallic whiskers are heavy, so it’s not very fast, but it has the power to dig through bedrock."
  },
  {
    "id": "20005200",
    "name": "Meowth",
    "description": "When visiting a junkyard, you may catch sight of it having an intense fight with Murkrow over shiny objects."
  },
  {
    "id": "20005300",
    "name": "Persian",
    "description": "This Pokémon is popular with rich people. It’s also targeted by hunters who are after the jewel in its forehead."
  },
  {
    "id": "20005361",
    "name": "Persian",
    "description": "In contrast to its lovely face, it’s so brutal that it tortures its weakened prey rather than finishing them off."
  },
  {
    "id": "20005400",
    "name": "Psyduck",
    "description": "Using psychokinesis gives it a headache, so it normally passes the time spacing out and doing as little as possible."
  },
  {
    "id": "20005800",
    "name": "Growlithe",
    "description": "While it’s quite friendly toward humans once it’s grown used to them, in the wild it must be quite fierce to defend its territory from Rockruff."
  },
  {
    "id": "20005900",
    "name": "Arcanine",
    "description": "Legends tell of its fighting alongside a general and conquering a whole country."
  },
  {
    "id": "20006500",
    "name": "Alakazam",
    "description": "It uses its psychic powers to make the spoons it carries. Each spoon is an original that there’s only one of in the whole world."
  },
  {
    "id": "20006600",
    "name": "Machop",
    "description": "Once this Pokémon has gained enough confidence and muscle from training with its friends, it challenges Makuhita to a battle."
  },
  {
    "id": "20006800",
    "name": "Machamp",
    "description": "It grasps its opponents with its four arms and twists them up in an intricate hold. People call it “the It special.”"
  },
  {
    "id": "20006900",
    "name": "Bellsprout",
    "description": "It’s thin and flexible body lets it bend and sway to avoid any attack, however strong it may be. From its mouth, this Pokémon spits a corrosive fluid that melts even iron."
  },
  {
    "id": "20007000",
    "name": "Weepinbell",
    "description": "It has a large hook on its rear end. At night, the Pokémon hooks on to a tree branch and goes to sleep. If it moves around in its sleep, it may wake up to find itself on the ground."
  },
  {
    "id": "20007100",
    "name": "Victreebel",
    "description": "It has a long vine that extends from its head. This vine is waved and flicked about as if it were an animal to attract prey. When an unsuspecting prey draws near, this Pokémon swallows it whole."
  },
  {
    "id": "20007400",
    "name": "Geodude",
    "description": "It that have lived a long life have had all their edges smoothed out until they’re totally round. They also have a calm, quiet disposition."
  },
  {
    "id": "20007461",
    "name": "Geodude",
    "description": "If you mistake it for a rock and step on it, it will headbutt you in anger. In addition to the pain, it will also zap you with a shock."
  },
  {
    "id": "20007500",
    "name": "Graveler",
    "description": "It climbs up cliffs as it heads toward the peak of a mountain. As soon as it reaches the summit, it rolls back down the way it came."
  },
  {
    "id": "20007561",
    "name": "Graveler",
    "description": "When two It fight each other, it fills the surroundings with flashes of light and sound. People call it the “fireworks of the earth.”"
  },
  {
    "id": "20007600",
    "name": "Golem",
    "description": "When It grow old, they stop shedding their shells. Those that have lived a long, long time have shells green with moss."
  },
  {
    "id": "20007700",
    "name": "Ponyta",
    "description": "It is very weak at birth. It can barely stand up. This Pokémon becomes stronger by stumbling and falling to keep up with its parent."
  },
  {
    "id": "20007800",
    "name": "Rapidash",
    "description": "It usually can be seen casually cantering in the fields and plains. However, when this Pokémon turns serious, its fiery manes flare and blaze as it gallops its way up to 150 mph."
  },
  {
    "id": "20008100",
    "name": "Magnemite",
    "description": "It’s frequently the cause of power outages, which is why some power plants send out electrical signals that it can’t stand."
  },
  {
    "id": "20008600",
    "name": "Seel",
    "description": "Thanks to its thick fat, cold seas don’t bother it at all, but it gets tired pretty easily in warm waters."
  },
  {
    "id": "20008700",
    "name": "Dewgong",
    "description": "It swims through the ocean at a speed of eight knots, searching for Pokémon that will become its prey. It’s especially fond of Wishiwashi."
  },
  {
    "id": "20008800",
    "name": "Grimer",
    "description": "It was born from sludge on the ocean floor. In a sterile environment, the germs within its body can’t multiply, and it dies."
  },
  {
    "id": "20008900",
    "name": "Muk",
    "description": "Their food sources have decreased, and their numbers have declined sharply. Sludge ponds are being built to prevent their extinction."
  },
  {
    "id": "20009300",
    "name": "Haunter",
    "description": "On moonless nights, It searches for someone to curse, so it’s best not to go out walking around."
  },
  {
    "id": "20009401",
    "name": "Gengar",
    "description": "You can hear tales told all over the world about how It will pay a visit to children who are naughty."
  },
  {
    "id": "20009500",
    "name": "Onix",
    "description": "It has a magnet in its brain. It acts as a compass so that this Pokémon does not lose direction while it is tunneling. As it grows older, its body becomes increasingly rounder and smoother."
  },
  {
    "id": "20010000",
    "name": "Voltorb",
    "description": "It was first sighted at a company that manufactures Poké Balls. The link between that sighting and the fact that this Pokémon looks very similar to a Poké Ball remains a mystery."
  },
  {
    "id": "20010100",
    "name": "Electrode",
    "description": "It eats electricity in the atmosphere. On days when lightning strikes, you can see this Pokémon exploding all over the place from eating too much electricity."
  },
  {
    "id": "20010200",
    "name": "Exeggcute",
    "description": "Six of them form a single Pokémon. Should one of the six be lost, the next morning there will once more be six."
  },
  {
    "id": "20010561",
    "name": "Marowak",
    "description": "The rich greenery of the Alola region is hard on It. It controls fire to stay alive."
  },
  {
    "id": "20011000",
    "name": "Weezing",
    "description": "It loves the gases given off by rotted kitchen garbage. This Pokémon will find a dirty, unkempt house and make it its home. At night, when the people in the house are asleep, it will go through the trash."
  },
  {
    "id": "20011400",
    "name": "Tangela",
    "description": "It’s vines snap off easily if they are grabbed. This happens without pain, allowing it to make a quick getaway. The lost vines are replaced by newly grown vines the very next day."
  },
  {
    "id": "20011800",
    "name": "Goldeen",
    "description": "Although known for their splendid tail fins, It apparently compete among themselves to see whose horn is thickest and sharpest."
  },
  {
    "id": "20011900",
    "name": "Seaking",
    "description": "Its horn spins like a drill to steadily hollow out rocks—even harder ones. The coloration of the male is more vivid."
  },
  {
    "id": "20012100",
    "name": "Starmie",
    "description": "Its sparkling core is called “the gem of the sea.” This core can be made into high-priced accessories that are traded in secret."
  },
  {
    "id": "20012300",
    "name": "Scyther",
    "description": "Its two sharp scythes are more than just weapons. It uses them with dexterity to dress its prey before eating."
  },
  {
    "id": "20012700",
    "name": "Pinsir",
    "description": "Although it’s tough, it can’t handle cold well. When night falls, it buries itself in leafage and sleeps."
  },
  {
    "id": "20012800",
    "name": "Tauros",
    "description": "They live in groups. The one with the longest, thickest, and most-scarred horns is the boss of the herd."
  },
  {
    "id": "20013000",
    "name": "Gyarados",
    "description": "It fires hyper beams in all directions, burning the surrounding area to ash. There are some regions where it’s called “the deity of destruction.”"
  },
  {
    "id": "20013101",
    "name": "Lapras",
    "description": "They’ve been so cherished that there’s now an overabundance. The fish Pokémon population has declined in waters with too many It."
  },
  {
    "id": "20013300",
    "name": "Eevee",
    "description": "The question of why only It has such unstable genes has still not been solved."
  },
  {
    "id": "20014000",
    "name": "Kabuto",
    "description": "This Pokémon thrived 300 million years ago. It’s said that living specimens can still be seen in a certain region—a rare sight."
  },
  {
    "id": "20014100",
    "name": "Kabutops",
    "description": "Its body had begun to change so it could function on land. But it didn’t adapt in time and went extinct."
  },
  {
    "id": "20014200",
    "name": "Aerodactyl",
    "description": "Restored from DNA found in amber, this Pokémon exhibited ferocity that was greater than expected. Some casualties resulted."
  },
  {
    "id": "20014700",
    "name": "Dratini",
    "description": "It’s still weak, so it lurks on the floor of bodies of water, eating whatever food sinks down and living a quiet life."
  },
  {
    "id": "20014900",
    "name": "Dragonite",
    "description": "It flies over raging seas as if they were nothing. Observing this, a ship’s captain dubbed this Pokémon “the sea incarnate.”"
  },
  {
    "id": "20015000",
    "name": "Mewtwo",
    "description": "It is a Pokémon that was created by genetic manipulation. However, even though the scientific power of humans created this Pokémon’s body, they failed to endow It with a compassionate heart."
  },
  {
    "id": "20015100",
    "name": "Mew",
    "description": "It is said to possess the genetic composition of all Pokémon. It is capable of making itself invisible at will, so it entirely avoids notice even if it approaches people."
  },
  {
    "id": "20015112",
    "name": "Mew",
    "description": "It is said to possess the genetic composition of all Pokémon. It is capable of making itself invisible at will, so it entirely avoids notice even if it approaches people."
  },
  {
    "id": "20015200",
    "name": "Chikorita",
    "description": "In battle, It waves its leaf around to keep the foe at bay. However, a sweet fragrance also wafts from the leaf, becalming the battling Pokémon and creating a cozy, friendly atmosphere all around."
  },
  {
    "id": "20015301",
    "name": "Bayleef",
    "description": "It’s neck is ringed by curled-up leaves. Inside each tubular leaf is a small shoot of a tree. The fragrance of this shoot makes people peppy."
  },
  {
    "id": "20015401",
    "name": "Meganium",
    "description": "The fragrance of It’s flower soothes and calms emotions. In battle, this Pokémon gives off more of its becalming scent to blunt the foe’s fighting spirit."
  },
  {
    "id": "20015500",
    "name": "Cyndaquil",
    "description": "It protects itself by flaring up the flames on its back. The flames are vigorous if the Pokémon is angry. However, if it is tired, the flames splutter fitfully with incomplete combustion."
  },
  {
    "id": "20015600",
    "name": "Quilava",
    "description": "It keeps its foes at bay with the intensity of its flames and gusts of superheated air. This Pokémon applies its outstanding nimbleness to dodge attacks even while scorching the foe with flames."
  },
  {
    "id": "20015700",
    "name": "Typhlosion",
    "description": "It obscures itself behind a shimmering heat haze that it creates using its intensely hot flames. This Pokémon creates blazing explosive blasts that burn everything to cinders."
  },
  {
    "id": "20015800",
    "name": "Totodile",
    "description": "Despite the smallness of its body, It’s jaws are very powerful. While the Pokémon may think it is just playfully nipping, its bite has enough power to cause serious injury."
  },
  {
    "id": "20015901",
    "name": "Croconaw",
    "description": "Once It has clamped its jaws on its foe, it will absolutely not let go. Because the tips of its fangs are forked back like barbed fishhooks, they become impossible to remove when they have sunk in."
  },
  {
    "id": "20016000",
    "name": "Feraligatr",
    "description": "It intimidates its foes by opening its huge mouth. In battle, it will kick the ground hard with its thick and powerful hind legs to charge at the foe at an incredible speed."
  },
  {
    "id": "20016701",
    "name": "Spinarak",
    "description": "With threads from its mouth, it fashions sturdy webs that won’t break even if you set a rock on them."
  },
  {
    "id": "20016800",
    "name": "Ariados",
    "description": "Every night, it wanders around in search of prey, whose movements it restrains by spewing threads before it bites into them with its fangs."
  },
  {
    "id": "20016900",
    "name": "Crobat",
    "description": "Its fangs are so sharp, if it bites you in the dark and sucks your blood, you won’t notice any pain or realize you’ve been bitten."
  },
  {
    "id": "20017500",
    "name": "Togepi",
    "description": "As its energy, It uses the positive emotions of compassion and pleasure exuded by people and Pokémon. This Pokémon stores up feelings of happiness inside its shell, then shares them with others."
  },
  {
    "id": "20017801",
    "name": "Xatu",
    "description": "It’s said that while this Pokémon has the power to predict the future, it’s not powerful enough to change the future it sees."
  },
  {
    "id": "20018300",
    "name": "Marill",
    "description": "It’s oil-filled tail acts much like a life preserver. If you see just its tail bobbing on the water’s surface, it’s a sure indication that this Pokémon is diving beneath the water to feed on aquatic plants."
  },
  {
    "id": "20018700",
    "name": "Hoppip",
    "description": "This Pokémon drifts and floats with the wind. If it senses the approach of strong winds, It links its leaves with other It to prepare against being blown away."
  },
  {
    "id": "20018800",
    "name": "Skiploom",
    "description": "It’s flower blossoms when the temperature rises above 64 degrees Fahrenheit. How much the flower opens depends on the temperature. For that reason, this Pokémon is sometimes used as a thermometer."
  },
  {
    "id": "20018900",
    "name": "Jumpluff",
    "description": "It rides warm southern winds to cross the sea and fly to foreign lands. The Pokémon descends to the ground when it encounters cold air while it is floating."
  },
  {
    "id": "20019700",
    "name": "Umbreon",
    "description": "This Pokémon is nocturnal. Even in total darkness, its large eyes can spot its prey clearly!"
  },
  {
    "id": "20020801",
    "name": "Steelix",
    "description": "It lives even further underground than Onix. This Pokémon is known to dig toward the earth’s core. There are records of this Pokémon reaching a depth of over six-tenths of a mile underground."
  },
  {
    "id": "20021000",
    "name": "Granbull",
    "description": "While it has powerful jaws, it doesn’t care for disputes, so it rarely has a chance to display their might."
  },
  {
    "id": "20021800",
    "name": "Slugma",
    "description": "Molten magma courses throughout It’s circulatory system. If this Pokémon is chilled, the magma cools and hardens. Its body turns brittle and chunks fall off, reducing its size."
  },
  {
    "id": "20022400",
    "name": "Octillery",
    "description": "The ink it spits when escaping is special. It contains a substance that dulls the sense of smell, so Pokémon with keen noses get lost."
  },
  {
    "id": "20022500",
    "name": "Delibird",
    "description": "It shares its food with people who are stranded. Because It is omnivorous, sometimes it gives those people bug Pokémon."
  },
  {
    "id": "20022901",
    "name": "Houndoom",
    "description": "They spew flames mixed with poison to finish off their opponents. They divvy up their prey evenly among the members of their pack."
  },
  {
    "id": "20023000",
    "name": "Kingdra",
    "description": "It lives at extreme ocean depths that are otherwise uninhabited. It has long been believed that the yawning of this Pokémon creates spiraling ocean currents."
  },
  {
    "id": "20023100",
    "name": "Phanpy",
    "description": "For its nest, It digs a vertical pit in the ground at the edge of a river. It marks the area around its nest with its trunk to let the others know that the area has been claimed."
  },
  {
    "id": "20024100",
    "name": "Miltank",
    "description": "It produces over five gallons of milk a day. The higher the quality of the pastures it lives in, the richer and tastier its milk becomes."
  },
  {
    "id": "20024200",
    "name": "Blissey",
    "description": "Their eggs are such a delicacy that some say eating one will bring you happiness. These eggs fetch the highest prices on the market."
  },
  {
    "id": "20024400",
    "name": "Entei",
    "description": "It embodies the passion of magma. This Pokémon is thought to have been born in the eruption of a volcano. It sends up massive bursts of fire that utterly consume all that they touch."
  },
  {
    "id": "20024800",
    "name": "Tyranitar",
    "description": "It wanders through the mountains seeking opponents to fight. If it finds an opponent that’s not worthy, It ignores it and wanders on."
  },
  {
    "id": "20025000",
    "name": "Ho-Oh",
    "description": "It’s feathers glow in seven colors depending on the angle at which they are struck by light. These feathers are said to bring happiness to the bearers. This Pokémon is said to live at the foot of a rainbow."
  },
  {
    "id": "20025200",
    "name": "Treecko",
    "description": "It has small hooks on the bottom of its feet that enable it to scale vertical walls. This Pokémon attacks by slamming foes with its thick tail."
  },
  {
    "id": "20025300",
    "name": "Grovyle",
    "description": "The leaves growing out of It’s body are convenient for camouflaging it from enemies in the forest. This Pokémon is a master at climbing trees in jungles."
  },
  {
    "id": "20025400",
    "name": "Sceptile",
    "description": "The leaves growing on It’s body are very sharp edged. This Pokémon is very agile—it leaps all over the branches of trees and jumps on its foe from above or behind."
  },
  {
    "id": "20025500",
    "name": "Torchic",
    "description": "It sticks with its Trainer, following behind with unsteady steps. This Pokémon breathes fire of over 1,800 degrees Fahrenheit, including fireballs that leave the foe scorched black."
  },
  {
    "id": "20025600",
    "name": "Combusken",
    "description": "It toughens up its legs and thighs by running through fields and mountains. This Pokémon’s legs possess both speed and power, enabling it to dole out 10 kicks in one second."
  },
  {
    "id": "20025700",
    "name": "Blaziken",
    "description": "In battle, It blows out intense flames from its wrists and attacks foes courageously. The stronger the foe, the more intensely this Pokémon’s wrists burn."
  },
  {
    "id": "20025800",
    "name": "Mudkip",
    "description": "The fin on It’s head acts as highly sensitive radar. Using this fin to sense movements of water and air, this Pokémon can determine what is taking place around it without using its eyes."
  },
  {
    "id": "20025900",
    "name": "Marshtomp",
    "description": "The surface of It’s body is enveloped by a thin, sticky film that enables it to live on land. This Pokémon plays in mud on beaches when the ocean tide is low."
  },
  {
    "id": "20026000",
    "name": "Swampert",
    "description": "It is very strong. It has enough power to easily drag a boulder weighing more than a ton. This Pokémon also has powerful vision that lets it see even in murky water."
  },
  {
    "id": "20026100",
    "name": "Poochyena",
    "description": "At first sight, It takes a bite at anything that moves. This Pokémon chases after prey until the victim becomes exhausted. However, it may turn tail if the prey strikes back."
  },
  {
    "id": "20026200",
    "name": "Mightyena",
    "description": "It gives obvious signals when it is preparing to attack. It starts to growl deeply and then flattens its body. This Pokémon will bite savagely with its sharply pointed fangs."
  },
  {
    "id": "20026700",
    "name": "Beautifly",
    "description": "It’s favorite food is the sweet pollen of flowers. If you want to see this Pokémon, just leave a potted flower by an open window. It is sure to come looking for pollen."
  },
  {
    "id": "20026800",
    "name": "Cascoon",
    "description": "It makes its protective cocoon by wrapping its body entirely with a fine silk from its mouth. Once the silk goes around its body, it hardens. This Pokémon prepares for its evolution inside the cocoon."
  },
  {
    "id": "20026900",
    "name": "Dustox",
    "description": "It is instinctively drawn to light. Swarms of this Pokémon are attracted by the bright lights of cities, where they wreak havoc by stripping the leaves off roadside trees for food."
  },
  {
    "id": "20027100",
    "name": "Lombre",
    "description": "It is nocturnal—it will get active after dusk. It is also a mischief maker. When this Pokémon spots anglers, it tugs on their fishing lines from beneath the surface and enjoys their consternation."
  },
  {
    "id": "20027400",
    "name": "Nuzleaf",
    "description": "It live in densely overgrown forests. They occasionally venture out of the forest to startle people. This Pokémon dislikes having its long nose pinched."
  },
  {
    "id": "20027700",
    "name": "Swellow",
    "description": "It flies high above our heads, making graceful arcs in the sky. This Pokémon dives at a steep angle as soon as it spots its prey. The hapless prey is tightly grasped by It’s clawed feet, preventing escape."
  },
  {
    "id": "20027901",
    "name": "Pelipper",
    "description": "It places small Pokémon into its spacious beak and carries them around. No one knows where it’s taking them."
  },
  {
    "id": "20028200",
    "name": "Gardevoir",
    "description": "It has the ability to read the future. If it senses impending danger to its Trainer, this Pokémon is said to unleash its psychokinetic energy at full power."
  },
  {
    "id": "20028301",
    "name": "Surskit",
    "description": "If it’s in a pinch, it will secrete a sweet liquid from the tip of its head. Syrup made from gathering that liquid is tasty on bread."
  },
  {
    "id": "20028400",
    "name": "Masquerain",
    "description": "It intimidates enemies with the eyelike patterns of its eyespots. If that doesn’t work, it deftly makes its escape on its set of four wings."
  },
  {
    "id": "20028900",
    "name": "Slaking",
    "description": "It spends all day lying down and lolling about. It eats grass growing within its reach. If it eats all the grass it can reach, this Pokémon reluctantly moves to another spot."
  },
  {
    "id": "20029600",
    "name": "Makuhita",
    "description": "It practices its slaps by repeatedly slapping tree trunks. It has been known to slap an Exeggutor and get flung away."
  },
  {
    "id": "20029700",
    "name": "Hariyama",
    "description": "Although they enjoy comparing their strength, they’re also kind. They value etiquette, praising opponents they battle."
  },
  {
    "id": "20029900",
    "name": "Nosepass",
    "description": "It moves less than an inch a year, but when it’s in a jam, it will spin and drill down into the ground in a split second."
  },
  {
    "id": "20030701",
    "name": "Meditite",
    "description": "It undertakes rigorous mental training deep in the mountains. However, whenever it meditates, this Pokémon always loses its concentration and focus. As a result, its training never ends."
  },
  {
    "id": "20030801",
    "name": "Medicham",
    "description": "It is said that through meditation, It heightens energy inside its body and sharpens its sixth sense. This Pokémon hides its presence by merging itself with fields and mountains."
  },
  {
    "id": "20031900",
    "name": "Sharpedo",
    "description": "People believe that carrying one of its discarded fangs will prevent mishaps at sea, so the fangs are made into accessories."
  },
  {
    "id": "20032200",
    "name": "Numel",
    "description": "It is extremely dull witted—it doesn’t notice being hit. However, it can’t stand hunger for even a second. This Pokémon’s body is a seething cauldron of boiling magma."
  },
  {
    "id": "20032400",
    "name": "Torkoal",
    "description": "You can tell how it’s feeling by the smoke spouting from its shell. Tremendous velocity is a sign of good health."
  },
  {
    "id": "20032500",
    "name": "Spoink",
    "description": "It bounces around on its tail. The shock of its bouncing makes its heart pump. As a result, this Pokémon cannot afford to stop bouncing—if it stops, its heart will stop."
  },
  {
    "id": "20032600",
    "name": "Grumpig",
    "description": "It uses the black pearls on its body to amplify its psychic power waves for gaining total control over its foe. When this Pokémon uses its special power, its snorting breath grows labored."
  },
  {
    "id": "20032800",
    "name": "Trapinch",
    "description": "Its jaws are strong enough to crush rocks but so heavy that it can’t get up if it flips over. Sandile seize those moments as their chance."
  },
  {
    "id": "20032900",
    "name": "Vibrava",
    "description": "It vibrates its wings to generate ultrasonic waves, causing its prey to faint. Then it buries the prey alive in the sand to preserve it."
  },
  {
    "id": "20033400",
    "name": "Altaria",
    "description": "It dances and wheels through the sky among billowing, cotton-like clouds. By singing melodies in its crystal-clear voice, this Pokémon makes its listeners experience dreamy wonderment."
  },
  {
    "id": "20033600",
    "name": "Seviper",
    "description": "It shares a generations-long feud with Zangoose. The scars on its body are evidence of vicious battles. This Pokémon attacks using its sword-edged tail."
  },
  {
    "id": "20033700",
    "name": "Lunatone",
    "description": "It was discovered at a location where a meteoroid fell. As a result, some people theorize that this Pokémon came from space. However, no one has been able to prove this theory so far."
  },
  {
    "id": "20033800",
    "name": "Solrock",
    "description": "It is a new species of Pokémon that is said to have fallen from space. It floats in air and moves silently. In battle, this Pokémon releases intensely bright light."
  },
  {
    "id": "20035001",
    "name": "Milotic",
    "description": "While It is said to be the most beautiful Pokémon, Trainers who like Feebas and have raised it are seemingly disappointed by It."
  },
  {
    "id": "20035601",
    "name": "Dusclops",
    "description": "It’s body is completely hollow—there is nothing at all inside. It is said that its body is like a black hole. This Pokémon will absorb anything into its body, but nothing will ever come back out."
  },
  {
    "id": "20035900",
    "name": "Absol",
    "description": "The only thing unlucky about It is its appearance. It protects fields and warns people of disaster, so one ought to be grateful for it."
  },
  {
    "id": "20036100",
    "name": "Snorunt",
    "description": "Rich people from cold areas all share childhood memories of playing with It."
  },
  {
    "id": "20036200",
    "name": "Glalie",
    "description": "It freezes its prey and chews them whole. However, it prefers to eat Pokémon like Vanillite that are already frozen."
  },
  {
    "id": "20036300",
    "name": "Spheal",
    "description": "It is much faster rolling than walking to get around. When groups of this Pokémon eat, they all clap at once to show their pleasure. Because of this, their mealtimes are noisy."
  },
  {
    "id": "20036400",
    "name": "Sealeo",
    "description": "It has the habit of always juggling on the tip of its nose anything it sees for the first time. This Pokémon occasionally entertains itself by balancing and rolling a Spheal on its nose."
  },
  {
    "id": "20036500",
    "name": "Walrein",
    "description": "It’s two massively developed tusks can totally shatter blocks of ice weighing 10 tons with one blow. This Pokémon’s thick coat of blubber insulates it from subzero temperatures."
  },
  {
    "id": "20037100",
    "name": "Bagon",
    "description": "Whenever it sees bird Pokémon flying through the sky, it becomes envious and smashes its surroundings to bits with headbutts."
  },
  {
    "id": "20037300",
    "name": "Salamence",
    "description": "Overjoyed at finally being able to fly, it flies all over the place and usually doesn’t land until it’s completely exhausted and needs to sleep."
  },
  {
    "id": "20037600",
    "name": "Metagross",
    "description": "It boasts not only psychic powers but also fantastic strength. It grabs its prey with its four legs and holds them in place with its claws."
  },
  {
    "id": "20037700",
    "name": "Regirock",
    "description": "It was sealed away by people long ago. If this Pokémon’s body is damaged in battle, it is said to seek out suitable rocks on its own to repair itself."
  },
  {
    "id": "20038200",
    "name": "Kyogre",
    "description": "It is said to be the personification of the sea itself. Legends tell of its many clashes against Groudon, as each sought to gain the power of nature."
  },
  {
    "id": "20038300",
    "name": "Groudon",
    "description": "It is said to be the personification of the land itself. Legends tell of its many clashes against Kyogre, as each sought to gain the power of nature."
  },
  {
    "id": "20038400",
    "name": "Rayquaza",
    "description": "It is said to have lived for hundreds of millions of years. Legends remain of how it put to rest the clash between Kyogre and Groudon."
  },
  {
    "id": "20038700",
    "name": "Turtwig",
    "description": "Photosynthesis occurs across its body under the sun. The shell on its back is actually hardened soil."
  },
  {
    "id": "20038800",
    "name": "Grotle",
    "description": "It lives along water in forests. In the daytime, it leaves the forest to sunbathe its treed shell."
  },
  {
    "id": "20038900",
    "name": "Torterra",
    "description": "Ancient people imagined that beneath the ground, a gigantic It dwelled."
  },
  {
    "id": "20039200",
    "name": "Infernape",
    "description": "Its crown of fire is indicative of its fiery nature. It is beaten by none in terms of quickness."
  },
  {
    "id": "20039300",
    "name": "Piplup",
    "description": "It doesn’t like to be taken care of. It’s difficult to bond with since it won’t listen to its Trainer."
  },
  {
    "id": "20039400",
    "name": "Prinplup",
    "description": "It lives alone, away from others. Apparently, every one of them believes it is the most important."
  },
  {
    "id": "20039500",
    "name": "Empoleon",
    "description": "It swims as fast as a jet boat. The edges of its wings are sharp and can slice apart drifting ice."
  },
  {
    "id": "20039600",
    "name": "Starly",
    "description": "They flock in great numbers. Though small, they flap their wings with great power."
  },
  {
    "id": "20039700",
    "name": "Staravia",
    "description": "They maintain huge flocks, although fierce scuffles break out between various flocks."
  },
  {
    "id": "20039800",
    "name": "Staraptor",
    "description": "The muscles in its wings and legs are strong. It can easily fly while gripping a small Pokémon."
  },
  {
    "id": "20040000",
    "name": "Bibarel",
    "description": "It busily makes its nest with stacks of branches and roots it has cut up with its sharp incisors."
  },
  {
    "id": "20040500",
    "name": "Luxray",
    "description": "When its eyes gleam gold, it can spot hiding prey—even those taking shelter behind a wall."
  },
  {
    "id": "20040701",
    "name": "Roserade",
    "description": "Luring prey with a sweet scent, it uses poison whips on its arms to poison, bind, and finish off the prey."
  },
  {
    "id": "20040800",
    "name": "Cranidos",
    "description": "A primeval Pokémon, it possesses a hard and sturdy skull, lacking any intelligence within."
  },
  {
    "id": "20040900",
    "name": "Rampardos",
    "description": "In ancient times, people would dig up fossils of this Pokémon and use its skull, which is harder than steel, to make helmets."
  },
  {
    "id": "20041000",
    "name": "Shieldon",
    "description": "A mild-mannered, herbivorous Pokémon, it used its face to dig up tree roots to eat. The skin on its face was plenty tough."
  },
  {
    "id": "20041900",
    "name": "Floatzel",
    "description": "It floats using its well-developed flotation sac. It assists in the rescues of drowning people."
  },
  {
    "id": "20042500",
    "name": "Drifloon",
    "description": "Its round body is stuffed with souls and expands each time it leads someone away."
  },
  {
    "id": "20042600",
    "name": "Drifblim",
    "description": "There’s a rumor that if you catch a It floating on the wind at dusk, you’ll be carried away to the afterlife."
  },
  {
    "id": "20042800",
    "name": "Lopunny",
    "description": "It regrows its coat twice a year. Mufflers and hats made from its fur are really warm."
  },
  {
    "id": "20042900",
    "name": "Mismagius",
    "description": "Feared for its wrath and the curses it spreads, this Pokémon will also, on a whim, cast spells that help people."
  },
  {
    "id": "20043000",
    "name": "Honchkrow",
    "description": "It will absolutely not forgive failure from or betrayal by its goons. It has no choice in this if it wants to maintain the order of the flock."
  },
  {
    "id": "20043700",
    "name": "Bronzong",
    "description": "In ages past, this Pokémon was revered as a bringer of rain. It was found buried in the ground."
  },
  {
    "id": "20044300",
    "name": "Gible",
    "description": "It reacts to anything that moves—flies right at it and bites it. Sometimes it injures itself, but it doesn’t care too much."
  },
  {
    "id": "20044501",
    "name": "Garchomp",
    "description": "It flies at the speed of sound while searching for prey, and it has midair battles with Salamence as the two compete for food."
  },
  {
    "id": "20044800",
    "name": "Lucario",
    "description": "It concentrates its mental energy and fires off mysterious waves called auras, which can crush boulders of large size to dust."
  },
  {
    "id": "20045500",
    "name": "Carnivine",
    "description": "It attracts prey with its sweet-smelling saliva, then chomps down. It takes a whole day to eat prey."
  },
  {
    "id": "20045900",
    "name": "Snover",
    "description": "During cold seasons, it migrates to the mountain’s lower reaches. It returns to the snow-covered summit in the spring."
  },
  {
    "id": "20046001",
    "name": "Abomasnow",
    "description": "It blankets wide areas in snow by whipping up blizzards. It is also known as “The Ice Monster.”"
  },
  {
    "id": "20046800",
    "name": "Togekiss",
    "description": "As everyone knows, it visits peaceful regions, bringing them gifts of kindness and sweet blessings."
  },
  {
    "id": "20047500",
    "name": "Gallade",
    "description": "Because it can sense what its foe is thinking, its attacks burst out first, fast, and fierce."
  },
  {
    "id": "20047601",
    "name": "Probopass",
    "description": "Although it can control its units known as Mini-Noses, they sometimes get lost and don’t come back."
  },
  {
    "id": "20047700",
    "name": "Dusknoir",
    "description": "It is said to take lost spirits into its pliant body and guide them home."
  },
  {
    "id": "20047911",
    "name": "Rotom",
    "description": "Research continues on this Pokémon, which could be the power source of a unique motor."
  },
  {
    "id": "20048400",
    "name": "Palkia",
    "description": "It is said to live in a gap in the spatial dimension parallel to ours. It appears in mythology."
  },
  {
    "id": "20049500",
    "name": "Snivy",
    "description": "Being exposed to sunlight makes its movements swifter. It uses vines more adeptly than its hands."
  },
  {
    "id": "20049601",
    "name": "Servine",
    "description": "It moves along the ground as if sliding. Its swift movements befuddle its foes, and it then attacks with a vine whip."
  },
  {
    "id": "20049701",
    "name": "Serperior",
    "description": "It only gives its all against strong opponents who are not fazed by the glare from It’s noble eyes."
  },
  {
    "id": "20049800",
    "name": "Tepig",
    "description": "It can deftly dodge its foe’s attacks while shooting fireballs from its nose. It roasts berries before it eats them."
  },
  {
    "id": "20049901",
    "name": "Pignite",
    "description": "The more it eats, the more fuel it has to make the fire in its stomach stronger. This fills it with even more power."
  },
  {
    "id": "20050000",
    "name": "Emboar",
    "description": "It can throw a fire punch by setting its fists on fire with its fiery chin. It cares deeply about its friends."
  },
  {
    "id": "20050100",
    "name": "Oshawott",
    "description": "The scalchop on its stomach isn’t just used for battle—it can be used to break open hard berries as well."
  },
  {
    "id": "20050200",
    "name": "Dewott",
    "description": "Strict training is how it learns its flowing double-scalchop technique."
  },
  {
    "id": "20050300",
    "name": "Samurott",
    "description": "In the time it takes a foe to blink, it can draw and sheathe the seamitars attached to its front legs."
  },
  {
    "id": "20050800",
    "name": "Stoutland",
    "description": "Its fur is long and thick. A long time ago in cold regions, every household kept a It."
  },
  {
    "id": "20050900",
    "name": "Purrloin",
    "description": "Its cute act is a ruse. When victims let down their guard, they find their items taken. It attacks with sharp claws."
  },
  {
    "id": "20051001",
    "name": "Liepard",
    "description": "Their beautiful form comes from the muscles they have developed. They run silently in the night."
  },
  {
    "id": "20051800",
    "name": "Musharna",
    "description": "The mist emanating from their foreheads is packed with the dreams of people and Pokémon."
  },
  {
    "id": "20052301",
    "name": "Zebstrika",
    "description": "When this ill-tempered Pokémon runs wild, it shoots lightning from its mane in all directions."
  },
  {
    "id": "20052400",
    "name": "Roggenrola",
    "description": "The hexagonal hole is its ear. Deep in that ear is an energy core, so if you stick your hand in there, It will be very angry!"
  },
  {
    "id": "20052500",
    "name": "Boldore",
    "description": "The energy overflowing from its body has turned into orange crystals that are hard enough to smash diamonds."
  },
  {
    "id": "20052600",
    "name": "Gigalith",
    "description": "When it fires off energy with all its might, the power creates countless fissures on its body."
  },
  {
    "id": "20053000",
    "name": "Excadrill",
    "description": "It can help in tunnel construction. Its drill has evolved into steel strong enough to bore through iron plates."
  },
  {
    "id": "20053400",
    "name": "Conkeldurr",
    "description": "It is thought that It taught humans how to make concrete more than 2,000 years ago."
  },
  {
    "id": "20053600",
    "name": "Palpitoad",
    "description": "When they vibrate the bumps on their heads, they can make waves in water or earthquake-like vibrations on land."
  },
  {
    "id": "20053700",
    "name": "Seismitoad",
    "description": "It increases the power of its punches by vibrating the bumps on its fists. It can turn a boulder to rubble with one punch."
  },
  {
    "id": "20053800",
    "name": "Throh",
    "description": "When it tightens its belt, it becomes stronger. Wild It use vines to weave their own belts."
  },
  {
    "id": "20053900",
    "name": "Sawk",
    "description": "Desiring the strongest karate chop, they seclude themselves in mountains and train without sleeping."
  },
  {
    "id": "20054200",
    "name": "Leavanny",
    "description": "Upon finding a small Pokémon, it weaves clothing for it from leaves by using the sticky silk secreted from its mouth."
  },
  {
    "id": "20054401",
    "name": "Whirlipede",
    "description": "Protected by a hard shell, it spins its body like a wheel and crashes furiously into its enemies."
  },
  {
    "id": "20054500",
    "name": "Scolipede",
    "description": "It clasps its prey with the claws on its neck until it stops moving. Then it finishes it off with deadly poison."
  },
  {
    "id": "20054600",
    "name": "Cottonee",
    "description": "To protect itself, it shoots cotton from its body. When it gets wet in the rain, its cotton grows moist and heavy, and it can’t move as well."
  },
  {
    "id": "20054700",
    "name": "Whimsicott",
    "description": "This nuisance sneaks into people’s homes, where it hides important things and scatters cotton all over the place."
  },
  {
    "id": "20055011",
    "name": "Basculin",
    "description": "Savage, violent Pokémon, red and blue It are always fighting each other over territory."
  },
  {
    "id": "20055300",
    "name": "Krookodile",
    "description": "When it spots prey, even at a distance of over 30 miles, it swims through the desert as if it were water, then jumps out and chomps them."
  },
  {
    "id": "20056100",
    "name": "Sigilyph",
    "description": "The guardians of an ancient city, they use their psychic power to attack enemies that invade their territory."
  },
  {
    "id": "20056500",
    "name": "Carracosta",
    "description": "Its jaws are terrifyingly powerful. It could eat Omastar and Omanyte whole and not be bothered in the slightest by their shells."
  },
  {
    "id": "20056700",
    "name": "Archeops",
    "description": "This ancient Pokémon’s plumage is delicate, so if anyone other than an experienced professional tries to restore it, they will fail."
  },
  {
    "id": "20057000",
    "name": "Zorua",
    "description": "This Pokémon has a cowardly disposition, so when it’s not around friends, it basically always stays transformed as something else."
  },
  {
    "id": "20057100",
    "name": "Zoroark",
    "description": "It doesn’t just transform itself—it also has the power to make hundreds of people see its illusions."
  },
  {
    "id": "20057900",
    "name": "Reuniclus",
    "description": "They use psychic power to control their arms, which are made of a special liquid. They can crush boulders psychically."
  },
  {
    "id": "20058100",
    "name": "Swanna",
    "description": "Despite their elegant appearance, they can flap their wings strongly and fly for thousands of miles."
  },
  {
    "id": "20058512",
    "name": "Deerling",
    "description": "Their coloring changes according to the seasons and can be slightly affected by the temperature and humidity as well."
  },
  {
    "id": "20059200",
    "name": "Frillish",
    "description": "It wraps its veillike arms and legs around prey swimming by and drags them down to the depths of the ocean."
  },
  {
    "id": "20059900",
    "name": "Klink",
    "description": "Interlocking two bodies and spinning around generates the energy they need to live."
  },
  {
    "id": "20060700",
    "name": "Litwick",
    "description": "While shining a light and pretending to be a guide, it leeches off the life force of any who follow it."
  },
  {
    "id": "20060900",
    "name": "Chandelure",
    "description": "Being consumed in It’s flame burns up the spirit, leaving the body behind."
  },
  {
    "id": "20061000",
    "name": "Axew",
    "description": "They use their tusks to crush the berries they eat. Repeated regrowth makes their tusks strong and sharp."
  },
  {
    "id": "20061200",
    "name": "Haxorus",
    "description": "They are kind but can be relentless when defending territory. They challenge foes with tusks that can cut steel."
  },
  {
    "id": "20061500",
    "name": "Cryogonal",
    "description": "They are born in snow clouds. They use chains made of ice crystals to capture prey."
  },
  {
    "id": "20062800",
    "name": "Braviary",
    "description": "The more scars it has on its front, the more heroic it’s considered to be. Those with many scars on their back are mocked by the flock."
  },
  {
    "id": "20063300",
    "name": "Deino",
    "description": "They cannot see, so they tackle and bite to learn about their surroundings. Their bodies are covered in wounds."
  },
  {
    "id": "20063500",
    "name": "Hydreigon",
    "description": "The heads on their arms do not have brains. They use all three heads to consume and destroy everything."
  },
  {
    "id": "20063700",
    "name": "Volcarona",
    "description": "As it flies, it scatters its flaming scales. It was feared by ancient people, who referred to it as “the rage of the sun.”"
  },
  {
    "id": "20063800",
    "name": "Cobalion",
    "description": "It has a body and heart of steel. Its glare is sufficient to make even an unruly Pokémon obey it."
  },
  {
    "id": "20064300",
    "name": "Reshiram",
    "description": "This legendary Pokémon can scorch the world with fire. It helps those who want to build a world of truth."
  },
  {
    "id": "20064400",
    "name": "Zekrom",
    "description": "This legendary Pokémon can scorch the world with lightning. It assists those who want to build an ideal world."
  },
  {
    "id": "20064611",
    "name": "Kyurem",
    "description": "This legendary ice Pokémon waits for a hero to fill in the missing parts of its body with truth or ideals."
  },
  {
    "id": "20070400",
    "name": "Litleo",
    "description": "When they’re young, they live with a pride. Once they’re able to hunt prey on their own, they’re kicked out and have to make their own way."
  },
  {
    "id": "20071311",
    "name": "Flabébé",
    "description": "It’s not safe without the power of a flower, but it will keep traveling around until it finds one with the color and shape it wants."
  },
  {
    "id": "20071700",
    "name": "Fennekin",
    "description": "Eating a twig fills it with energy, and its roomy ears give vent to air hotter than 390 degrees Fahrenheit."
  },
  {
    "id": "20071800",
    "name": "Braixen",
    "description": "It has a twig stuck in its tail. With friction from its tail fur, it sets the twig on fire and launches into battle."
  },
  {
    "id": "20071900",
    "name": "Delphox",
    "description": "It gazes into the flame at the tip of its branch to achieve a focused state, which allows it to see into the future."
  },
  {
    "id": "20072300",
    "name": "Froakie",
    "description": "It secretes flexible bubbles from its chest and back. The bubbles reduce the damage it would otherwise take when attacked."
  },
  {
    "id": "20072400",
    "name": "Frogadier",
    "description": "It can throw bubble-covered pebbles with precise control, hitting empty cans up to a hundred feet away."
  },
  {
    "id": "20072500",
    "name": "Greninja",
    "description": "It creates throwing stars out of compressed water. When it spins them and throws them at high speed, these stars can split metal in two."
  },
  {
    "id": "20073200",
    "name": "Heliolisk",
    "description": "They flare their frills and generate energy. A single It can generate sufficient electricity to power a skyscraper."
  },
  {
    "id": "20073300",
    "name": "Espurr",
    "description": "The organ that emits its intense psychic power is sheltered by its ears to keep power from leaking out."
  },
  {
    "id": "20073400",
    "name": "Meowstic",
    "description": "When in danger, it raises its ears and releases enough psychic power to grind a 10-ton truck into dust."
  },
  {
    "id": "20073511",
    "name": "Pumpkaboo",
    "description": "The pumpkin body is inhabited by a spirit trapped in this world. As the sun sets, it becomes restless and active."
  },
  {
    "id": "20073900",
    "name": "Amaura",
    "description": "It lived in cold areas in ancient times. It’s said that when It whinnies, auroras appear in the night sky."
  },
  {
    "id": "20074000",
    "name": "Aurorus",
    "description": "An It was found frozen solid within a glacier, just as it appeared long ago, which became quite a big event in the news."
  },
  {
    "id": "20074200",
    "name": "Swirlix",
    "description": "To entangle its opponents in battle, it extrudes white threads as sweet and sticky as cotton candy."
  },
  {
    "id": "20074611",
    "name": "Aegislash",
    "description": "Generations of kings were attended by these Pokémon, which used their spectral power to manipulate and control people and Pokémon."
  },
  {
    "id": "20075100",
    "name": "Avalugg",
    "description": "Its ice-covered body is as hard as steel. Its cumbersome frame crushes anything that stands in its way."
  },
  {
    "id": "20075300",
    "name": "Fletchling",
    "description": "While it’s an amiable Pokémon, if you touch it unexpectedly, it will heat up its body in an instant, and you’ll be burned."
  },
  {
    "id": "20075700",
    "name": "Clawitzer",
    "description": "It compresses the water it has sucked up and then projects it with enough power to punch a hole right through a thick sheet of iron."
  },
  {
    "id": "20076300",
    "name": "Goomy",
    "description": "It uses its horns to check out its surroundings. They’re very sensitive, so if you grab them, it will feel a strong shock and be unable to move."
  },
  {
    "id": "20076700",
    "name": "Sylveon",
    "description": "Once a fight breaks out, it will unflinchingly charge at dragon Pokémon that are many times larger than itself."
  },
  {
    "id": "20076800",
    "name": "Xerneas",
    "description": "Legends say it can share eternal life. It slept for a thousand years in the form of a tree before its revival."
  },
  {
    "id": "20076900",
    "name": "Yveltal",
    "description": "When this legendary Pokémon’s wings and tail feathers spread wide and glow red, it absorbs the life force of living creatures."
  },
  {
    "id": "20077400",
    "name": "Hoopa",
    "description": "In its true form, it possess a huge amount of power. Legends of its avarice tell how it once carried off an entire castle to gain the treasure hidden within."
  },
  {
    "id": "20080100",
    "name": "Mareanie",
    "description": "They eat Corsola branches, so It are hated by craftsmen who work with Corsola branches that have naturally fallen off."
  },
  {
    "id": "20080601",
    "name": "Salazzle",
    "description": "It lives deep in caves and forces the Salandit it has attracted with its pheromones to serve it."
  },
  {
    "id": "20080900",
    "name": "Toucannon",
    "description": "They smack beaks with others of their kind to communicate. The strength and number of hits tell each other how they feel."
  },
  {
    "id": "20081301",
    "name": "Steenee",
    "description": "It’s protected by its hard sepals, so it plays with bird Pokémon without worry. They peck it relentlessly, but it doesn’t care."
  },
  {
    "id": "20081400",
    "name": "Tsareena",
    "description": "A master of grand and beautiful kicks, it can knock out even kickboxing champions with a single blow."
  },
  {
    "id": "20081800",
    "name": "Kommo-o",
    "description": "When it howls after finishing off its prey, the metallic sounds of its celebrating comrades can be heard from all around."
  },
  {
    "id": "20081912",
    "name": "Mimikyu",
    "description": "It stands in front of a mirror, trying to fix its broken neck as if its life depended on it. It has a hard time getting it right, so it’s crying inside."
  },
  {
    "id": "20082300",
    "name": "Palossand",
    "description": "Each of its grains of sand has its own will. It eats small Pokémon and siphons away their vital essence while they’re still alive."
  },
  {
    "id": "20082800",
    "name": "Rockruff",
    "description": "As they develop, their disposition grows more violent and aggressive. Many Trainers find them too much to handle and abandon them."
  },
  {
    "id": "20082911",
    "name": "Lycanroc",
    "description": "The sharp rocks in its mane can cut like knives. It wears its prey down by degrees before finishing them off."
  },
  {
    "id": "20082921",
    "name": "Lycanroc",
    "description": "The sharp rocks in its mane can cut like knives. It wears its prey down by degrees before finishing them off."
  },
  {
    "id": "20083500",
    "name": "Ribombee",
    "description": "Rain makes pollen damp, so It hates rain. When it sees ominous clouds, it finds a hollow in a tree, where it waits stock-still."
  },
  {
    "id": "20084000",
    "name": "Mudsdale",
    "description": "It remains calm and unmoving no matter the situation. It mixes dirt with the saliva in its mouth to make a special kind of mud."
  },
  {
    "id": "20084100",
    "name": "Rowlet",
    "description": "It sends its feathers, which are as sharp as blades, flying in attack. Its legs are strong, so its kicks are also formidable."
  },
  {
    "id": "20084200",
    "name": "Dartrix",
    "description": "This narcissistic Pokémon is a clean freak. If you don’t groom it diligently, it will stop listening to you."
  },
  {
    "id": "20084300",
    "name": "Decidueye",
    "description": "It nocks its arrow quills and shoots them at opponents. When it simply can’t afford to miss, it tugs the vine on its head to improve its focus."
  },
  {
    "id": "20084600",
    "name": "Incineroar",
    "description": "Although it’s rough mannered and egotistical, it finds beating down unworthy opponents boring. It gets motivated for stronger opponents."
  },
  {
    "id": "20084700",
    "name": "Popplio",
    "description": "The balloons it inflates with its nose grow larger and larger as it practices day by day."
  },
  {
    "id": "20084800",
    "name": "Brionne",
    "description": "It gets excited when it sees a dance it doesn’t know. This hard worker practices diligently until it can learn that dance."
  },
  {
    "id": "20084900",
    "name": "Primarina",
    "description": "To It, every battle is a stage. It takes down its prey with beautiful singing and dancing."
  },
  {
    "id": "20085100",
    "name": "Araquanid",
    "description": "It usually passes its time in the water. When its belly is full, it stores its subdued prey in the water bubble on its head."
  },
  {
    "id": "20085200",
    "name": "Stufful",
    "description": "It boasts power enough to split large trees in half. The organ on its rear releases an odor that it uses to communicate with others of its kind."
  },
  {
    "id": "20085300",
    "name": "Bewear",
    "description": "It waves its hands wildly in intimidation and warning. Life is over for anyone who doesn’t run away as fast as possible."
  },
  {
    "id": "20085400",
    "name": "Turtonator",
    "description": "It lives in volcanoes and eats sulfur and other minerals. Materials from the food it eats form the basis of its explosive shell."
  },
  {
    "id": "20085800",
    "name": "Togedemaru",
    "description": "When it’s surprised or agitated, the 14 fur spikes on its back will stand up involuntarily."
  },
  {
    "id": "20086000",
    "name": "Crabominable",
    "description": "It stores coldness in its pincers and pummels its foes. It can even smash thick walls of ice to bits!"
  },
  {
    "id": "20086212",
    "name": "Silvally",
    "description": "Having been awakened successfully, it can change its type and battle—just like a certain Pokémon depicted in legends."
  },
  {
    "id": "20086300",
    "name": "Comfey",
    "description": "It stretches sticky vines out from its head and picks flowers to adorn itself with. When it doesn’t have any flowers, it feels uneasy."
  },
  {
    "id": "20086700",
    "name": "Golisopod",
    "description": "The shell covering its body is as hard as diamond. This Pokémon will do anything it takes to win."
  },
  {
    "id": "20087300",
    "name": "Solgaleo",
    "description": "Sometimes the result of its opening an Ultra Wormhole is that energy and life-forms from other worlds are called here to this world."
  },
  {
    "id": "20087400",
    "name": "Lunala",
    "description": "Records of it exist in writings from long, long ago, where it was known by the name “the beast that calls the moon.”"
  },
  {
    "id": "20087900",
    "name": "Pheromosa",
    "description": "A life-form that lives in another world, its body is thin and supple, but it also possesses great power."
  },
  {
    "id": "2008180000",
    "name": "Inteleon",
    "description": "It has many hidden capabilities, such as fingertips that can shoot water and a membrane on its back that it can use to glide through the air."
  },
  {
    "id": "2008340000",
    "name": "Drednaw",
    "description": "With jaws that can shear through steel rods, this highly aggressive Pokémon chomps down on its unfortunate prey."
  },
  {
    "id": "2008610000",
    "name": "Grimmsnarl",
    "description": "With the hair wrapped around its body helping to enhance its muscles, this Pokémon can overwhelm even Machamp."
  },
  {
    "id": "2008620031",
    "name": "Obstagoon",
    "description": "Its voice is staggering in volume. It has a tendency to take on a threatening posture and shout—this move is known as Obstruct."
  },
  {
    "id": "2008650031",
    "name": "Sirfetch’d",
    "description": "After deflecting attacks with its hard leaf shield, it strikes back with its sharp leek stalk. The leek stalk is both weapon and food."
  },
  {
    "id": "2008691111",
    "name": "Alcremie",
    "description": "When it trusts a Trainer, it will treat them to berries it’s decorated with cream."
  },
  {
    "id": "2008771100",
    "name": "Morpeko",
    "description": "It carries electrically roasted seeds with it as if they’re precious treasures. No matter how much it eats, it always gets hungry again in short order."
  },
  {
    "id": "2008771200",
    "name": "Morpeko",
    "description": "Intense hunger drives it to extremes of violence, and the electricity in its cheek sacs has converted into a Dark-type energy."
  },
  {
    "id": "2008840000",
    "name": "Duraludon",
    "description": "The special metal that composes its body is very light, so this Pokémon has considerable agility. It lives in caves because it dislikes the rain."
  },
  {
    "id": "2008881200",
    "name": "Zacian",
    "description": "Able to cut down anything with a single strike, it became known as the Fairy King’s Sword, and it inspired awe in friend and foe alike."
  },
  {
    "id": "2008891200",
    "name": "Zamazenta",
    "description": "Its ability to deflect any attack led to it being known as the Fighting Master’s Shield. It was feared and respected by all."
  },
  {
    "id": "2008900000",
    "name": "Eternatus",
    "description": "It was inside a meteorite that fell 20,000 years ago. There seems to be a connection between this Pokémon and the Dynamax phenomenon."
  }
]