[
  {
    "effect": "Has a 10% chance of making target Pokémon flinch with each hit.",
    "name": "stench",
    "description": "By releasing stench when attacking, this Pokémon may cause the target to flinch.",
    "id": 1
  },
  {
    "effect": "Summons rain that lasts indefinitely upon entering battle.",
    "name": "drizzle",
    "description": "The Pokémon makes it rain when it enters a battle.",
    "id": 2
  },
  {
    "effect": "Raises Speed one stage after each turn.",
    "name": "speed-boost",
    "description": "Its Speed stat is boosted every turn.",
    "id": 3
  },
  {
    "effect": "Protects against critical hits.",
    "name": "battle-armor",
    "description": "Hard armor protects the Pokémon from critical hits.",
    "id": 4
  },
  {
    "effect": "Prevents being KOed from full HP, leaving 1 HP instead. Protects against the one-hit KO moves regardless of HP.",
    "name": "sturdy",
    "description": "It cannot be knocked out with one hit. One-hit KO moves cannot knock it out, either.",
    "id": 5
  },
  {
    "effect": "Prevents self destruct, explosion, and aftermath from working while the Pokémon is in battle.",
    "name": "damp",
    "description": "Prevents the use of explosive moves such as Self-Destruct by dampening its surroundings.",
    "id": 6
  },
  {
    "effect": "Prevents paralysis.",
    "name": "limber",
    "description": "Its limber body protects the Pokémon from paralysis.",
    "id": 7
  },
  {
    "effect": "Increases evasion to 1.25× during a sandstorm. Protects against sandstorm damage.",
    "name": "sand-veil",
    "description": "Boosts the Pokémon’s evasion in a sandstorm.",
    "id": 8
  },
  {
    "effect": "Has a 30% chance of paralyzing attacking Pokémon on contact.",
    "name": "static",
    "description": "The Pokémon is charged with static electricity, so contact with it may cause paralysis.",
    "id": 9
  },
  {
    "effect": "Absorbs electric moves, healing for 1/4 max HP.",
    "name": "volt-absorb",
    "description": "Restores HP if hit by an Electric-type move, instead of taking damage.",
    "id": 10
  },
  {
    "effect": "Absorbs water moves, healing for 1/4 max HP.",
    "name": "water-absorb",
    "description": "Restores HP if hit by a Water-type move, instead of taking damage.",
    "id": 11
  },
  {
    "effect": "Prevents infatuation and protects against captivate.",
    "name": "oblivious",
    "description": "The Pokémon is oblivious, and that keeps it from being infatuated or falling for taunts.",
    "id": 12
  },
  {
    "effect": "Negates all effects of weather, but does not prevent the weather itself.",
    "name": "cloud-nine",
    "description": "Eliminates the effects of weather.",
    "id": 13
  },
  {
    "effect": "Increases moves' accuracy to 1.3×.",
    "name": "compound-eyes",
    "description": "The Pokémon’s compound eyes boost its accuracy.",
    "id": 14
  },
  {
    "effect": "Prevents sleep.",
    "name": "insomnia",
    "description": "The Pokémon is suffering from insomnia and cannot fall asleep.",
    "id": 15
  },
  {
    "effect": "Changes type to match when hit by a damaging move.",
    "name": "color-change",
    "description": "The Pokémon’s type becomes the type of the move used on it.",
    "id": 16
  },
  {
    "effect": "Prevents poison.",
    "name": "immunity",
    "description": "The immune system of the Pokémon prevents it from getting poisoned.",
    "id": 17
  },
  {
    "effect": "Protects against fire moves. Once one has been blocked, the Pokémon's own Fire moves inflict 1.5× damage until it leaves battle.",
    "name": "flash-fire",
    "description": "Powers up the Pokémon’s Fire-type moves if it’s hit by one.",
    "id": 18
  },
  {
    "effect": "Protects against incoming moves' extra effects.",
    "name": "shield-dust",
    "description": "This Pokémon’s dust blocks the additional effects of attacks taken.",
    "id": 19
  },
  {
    "effect": "Prevents confusion.",
    "name": "own-tempo",
    "description": "This Pokémon has its own tempo, and that prevents it from becoming confused.",
    "id": 20
  },
  {
    "effect": "Prevents being forced out of battle by other Pokémon's moves.",
    "name": "suction-cups",
    "description": "This Pokémon uses suction cups to stay in one spot to negate all moves and items that force switching out.",
    "id": 21
  },
  {
    "effect": "Lowers opponents' Attack one stage upon entering battle.",
    "name": "intimidate",
    "description": "The Pokémon intimidates opposing Pokémon upon entering battle, lowering their Attack stat.",
    "id": 22
  },
  {
    "effect": "Prevents opponents from fleeing or switching out.",
    "name": "shadow-tag",
    "description": "This Pokémon steps on the opposing Pokémon’s shadow to prevent it from escaping.",
    "id": 23
  },
  {
    "effect": "Damages attacking Pokémon for 1/8 their max HP on contact.",
    "name": "rough-skin",
    "description": "This Pokémon inflicts damage with its rough skin to the attacker on contact.",
    "id": 24
  },
  {
    "effect": "Protects against damaging moves that are not super effective.",
    "name": "wonder-guard",
    "description": "Its mysterious power only lets supereffective moves hit the Pokémon.",
    "id": 25
  },
  {
    "effect": "Evades ground moves.",
    "name": "levitate",
    "description": "By floating in the air, the Pokémon receives full immunity to all Ground-type moves.",
    "id": 26
  },
  {
    "effect": "Has a 30% chance of inflcting either paralysis, poison, or sleep on attacking Pokémon on contact.",
    "name": "effect-spore",
    "description": "Contact with the Pokémon may inflict poison, sleep, or paralysis on its attacker.",
    "id": 27
  },
  {
    "effect": "Copies burns, paralysis, and poison received onto the Pokémon that inflicted them.",
    "name": "synchronize",
    "description": "The attacker will receive the same status condition if it inflicts a burn, poison, or paralysis to the Pokémon.",
    "id": 28
  },
  {
    "effect": "Prevents stats from being lowered by other Pokémon.",
    "name": "clear-body",
    "description": "Prevents other Pokémon’s moves or Abilities from lowering the Pokémon’s stats.",
    "id": 29
  },
  {
    "effect": "Cures any major status ailment upon switching out.",
    "name": "natural-cure",
    "description": "All status conditions heal when the Pokémon switches out.",
    "id": 30
  },
  {
    "effect": "Redirects single-target electric moves to this Pokémon where possible. Absorbs Electric moves, raising Special Attack one stage.",
    "name": "lightning-rod",
    "description": "The Pokémon draws in all Electric-type moves. Instead of being hit by Electric-type moves, it boosts its Sp. Atk.",
    "id": 31
  },
  {
    "effect": "Doubles the chance of moves' extra effects occurring.",
    "name": "serene-grace",
    "description": "Boosts the likelihood of additional effects occurring when attacking.",
    "id": 32
  },
  {
    "effect": "Doubles Speed during rain.",
    "name": "swift-swim",
    "description": "Boosts the Pokémon’s Speed stat in rain.",
    "id": 33
  },
  {
    "effect": "Doubles Speed during strong sunlight.",
    "name": "chlorophyll",
    "description": "Boosts the Pokémon’s Speed stat in harsh sunlight.",
    "id": 34
  },
  {
    "effect": "Doubles the wild encounter rate.",
    "name": "illuminate",
    "description": "Raises the likelihood of meeting wild Pokémon by illuminating the surroundings.",
    "id": 35
  },
  {
    "effect": "Copies an opponent's ability upon entering battle.",
    "name": "trace",
    "description": "When it enters a battle, the Pokémon copies an opposing Pokémon’s Ability.",
    "id": 36
  },
  {
    "effect": "Doubles Attack in battle.",
    "name": "huge-power",
    "description": "Doubles the Pokémon’s Attack stat.",
    "id": 37
  },
  {
    "effect": "Has a 30% chance of poisoning attacking Pokémon on contact.",
    "name": "poison-point",
    "description": "Contact with the Pokémon may poison the attacker.",
    "id": 38
  },
  {
    "effect": "Prevents flinching.",
    "name": "inner-focus",
    "description": "The Pokémon’s intensely focused, and that protects the Pokémon from flinching.",
    "id": 39
  },
  {
    "effect": "Prevents freezing.",
    "name": "magma-armor",
    "description": "The Pokémon is covered with hot magma, which prevents the Pokémon from becoming frozen.",
    "id": 40
  },
  {
    "effect": "Prevents burns.",
    "name": "water-veil",
    "description": "The Pokémon is covered with a water veil, which prevents the Pokémon from getting a burn.",
    "id": 41
  },
  {
    "effect": "Prevents steel opponents from fleeing or switching out.",
    "name": "magnet-pull",
    "description": "Prevents Steel-type Pokémon from escaping using its magnetic force.",
    "id": 42
  },
  {
    "effect": "Protects against sound-based moves.",
    "name": "soundproof",
    "description": "Soundproofing of the Pokémon itself gives full immunity to all sound-based moves.",
    "id": 43
  },
  {
    "effect": "Heals for 1/16 max HP after each turn during rain.",
    "name": "rain-dish",
    "description": "The Pokémon gradually regains HP in rain.",
    "id": 44
  },
  {
    "effect": "Summons a sandstorm that lasts indefinitely upon entering battle.",
    "name": "sand-stream",
    "description": "The Pokémon summons a sandstorm when it enters a battle.",
    "id": 45
  },
  {
    "effect": "Increases the PP cost of moves targetting the Pokémon by one.",
    "name": "pressure",
    "description": "By putting pressure on the opposing Pokémon, it raises their PP usage.",
    "id": 46
  },
  {
    "effect": "Halves damage from fire and ice moves.",
    "name": "thick-fat",
    "description": "The Pokémon is protected by a layer of thick fat, which halves the damage taken from Fire- and Ice-type moves.",
    "id": 47
  },
  {
    "effect": "Makes sleep pass twice as quickly.",
    "name": "early-bird",
    "description": "The Pokémon awakens twice as fast as other Pokémon from sleep.",
    "id": 48
  },
  {
    "effect": "Has a 30% chance of burning attacking Pokémon on contact.",
    "name": "flame-body",
    "description": "Contact with the Pokémon may burn the attacker.",
    "id": 49
  },
  {
    "effect": "Ensures success fleeing from wild battles.",
    "name": "run-away",
    "description": "Enables a sure getaway from wild Pokémon.",
    "id": 50
  },
  {
    "effect": "Prevents accuracy from being lowered.",
    "name": "keen-eye",
    "description": "Keen eyes prevent other Pokémon from lowering this Pokémon’s accuracy.",
    "id": 51
  },
  {
    "effect": "Prevents Attack from being lowered by other Pokémon.",
    "name": "hyper-cutter",
    "description": "The Pokémon’s proud of its powerful pincers. They prevent other Pokémon from lowering its Attack stat.",
    "id": 52
  },
  {
    "effect": "Picks up other Pokémon's used and Flung held items. May also pick up an item after battle.",
    "name": "pickup",
    "description": "The Pokémon may pick up the item an opposing Pokémon used during a battle. It may pick up items outside of battle, too.",
    "id": 53
  },
  {
    "effect": "Skips every second turn.",
    "name": "truant",
    "description": "The Pokémon can’t use a move the following turn if it uses one.",
    "id": 54
  },
  {
    "effect": "Strengthens physical moves to inflict 1.5× damage, but decreases their accuracy to 0.8×.",
    "name": "hustle",
    "description": "Boosts the Attack stat, but lowers accuracy.",
    "id": 55
  },
  {
    "effect": "Has a 30% chance of infatuating attacking Pokémon on contact.",
    "name": "cute-charm",
    "description": "Contact with the Pokémon may cause infatuation.",
    "id": 56
  },
  {
    "effect": "Increases Special Attack to 1.5× when a friendly Pokémon has plus or minus.",
    "name": "plus",
    "description": "Boosts the Sp. Atk stat of the Pokémon if an ally with the Plus or Minus Ability is also in battle.",
    "id": 57
  },
  {
    "effect": "Increases Special Attack to 1.5× when a friendly Pokémon has plus or minus.",
    "name": "minus",
    "description": "Boosts the Sp. Atk stat of the Pokémon if an ally with the Plus or Minus Ability is also in battle.",
    "id": 58
  },
  {
    "effect": "Changes castform's type and form to match the weather.",
    "name": "forecast",
    "description": "The Pokémon transforms with the weather to change its type to Water, Fire, or Ice.",
    "id": 59
  },
  {
    "effect": "Prevents a held item from being removed by other Pokémon.",
    "name": "sticky-hold",
    "description": "Items held by the Pokémon are stuck fast and cannot be removed by other Pokémon.",
    "id": 60
  },
  {
    "effect": "Has a 33% chance of curing any major status ailment after each turn.",
    "name": "shed-skin",
    "description": "The Pokémon may heal its own status conditions by shedding its skin.",
    "id": 61
  },
  {
    "effect": "Increases Attack to 1.5× with a major status ailment.",
    "name": "guts",
    "description": "It’s so gutsy that having a status condition boosts the Pokémon’s Attack stat.",
    "id": 62
  },
  {
    "effect": "Increases Defense to 1.5× with a major status ailment.",
    "name": "marvel-scale",
    "description": "The Pokémon’s marvelous scales boost the Defense stat if it has a status condition.",
    "id": 63
  },
  {
    "effect": "Damages opponents using leeching moves for as much as they would heal.",
    "name": "liquid-ooze",
    "description": "Oozed liquid has strong stench, which damages attackers using any draining move.",
    "id": 64
  },
  {
    "effect": "Strengthens grass moves to inflict 1.5× damage at 1/3 max HP or less.",
    "name": "overgrow",
    "description": "Powers up Grass-type moves when the Pokémon’s HP is low.",
    "id": 65
  },
  {
    "effect": "Strengthens fire moves to inflict 1.5× damage at 1/3 max HP or less.",
    "name": "blaze",
    "description": "Powers up Fire-type moves when the Pokémon’s HP is low.",
    "id": 66
  },
  {
    "effect": "Strengthens water moves to inflict 1.5× damage at 1/3 max HP or less.",
    "name": "torrent",
    "description": "Powers up Water-type moves when the Pokémon’s HP is low.",
    "id": 67
  },
  {
    "effect": "Strengthens bug moves to inflict 1.5× damage at 1/3 max HP or less.",
    "name": "swarm",
    "description": "Powers up Bug-type moves when the Pokémon’s HP is low.",
    "id": 68
  },
  {
    "effect": "Protects against recoil damage.",
    "name": "rock-head",
    "description": "Protects the Pokémon from recoil damage.",
    "id": 69
  },
  {
    "effect": "Summons strong sunlight that lasts indefinitely upon entering battle.",
    "name": "drought",
    "description": "Turns the sunlight harsh when the Pokémon enters a battle.",
    "id": 70
  },
  {
    "effect": "Prevents opponents from fleeing or switching out. Eluded by flying-types and Pokémon in the air.",
    "name": "arena-trap",
    "description": "Prevents opposing Pokémon from fleeing.",
    "id": 71
  },
  {
    "effect": "Prevents sleep.",
    "name": "vital-spirit",
    "description": "The Pokémon is full of vitality, and that prevents it from falling asleep.",
    "id": 72
  },
  {
    "effect": "Prevents stats from being lowered by other Pokémon.",
    "name": "white-smoke",
    "description": "The Pokémon is protected by its white smoke, which prevents other Pokémon from lowering its stats.",
    "id": 73
  },
  {
    "effect": "Doubles Attack in battle.",
    "name": "pure-power",
    "description": "Using its pure power, the Pokémon doubles its Attack stat.",
    "id": 74
  },
  {
    "effect": "Protects against critical hits.",
    "name": "shell-armor",
    "description": "A hard shell protects the Pokémon from critical hits.",
    "id": 75
  },
  {
    "effect": "Negates all effects of weather, but does not prevent the weather itself.",
    "name": "air-lock",
    "description": "Eliminates the effects of weather.",
    "id": 76
  },
  {
    "effect": "Doubles evasion when confused.",
    "name": "tangled-feet",
    "description": "Raises evasion if the Pokémon is confused.",
    "id": 77
  },
  {
    "effect": "Absorbs electric moves, raising Speed one stage.",
    "name": "motor-drive",
    "description": "Boosts its Speed stat if hit by an Electric-type move, instead of taking damage.",
    "id": 78
  },
  {
    "effect": "Increases damage inflicted to 1.25× against Pokémon of the same gender, but decreases damage to 0.75× against the opposite gender.",
    "name": "rivalry",
    "description": "Becomes competitive and deals more damage to Pokémon of the same gender, but deals less to Pokémon of the opposite gender.",
    "id": 79
  },
  {
    "effect": "Raises Speed one stage upon flinching.",
    "name": "steadfast",
    "description": "The Pokémon’s determination boosts the Speed stat each time the Pokémon flinches.",
    "id": 80
  },
  {
    "effect": "Increases evasion to 1.25× during hail. Protects against hail damage.",
    "name": "snow-cloak",
    "description": "Boosts evasion in a hailstorm.",
    "id": 81
  },
  {
    "effect": "Makes the Pokémon eat any held Berry triggered by low HP below 1/2 its max HP.",
    "name": "gluttony",
    "description": "Makes the Pokémon eat a held Berry when its HP drops to half or less, which is sooner than usual.",
    "id": 82
  },
  {
    "effect": "Raises Attack to the maximum of six stages upon receiving a critical hit.",
    "name": "anger-point",
    "description": "The Pokémon is angered when it takes a critical hit, and that maxes its Attack stat.",
    "id": 83
  },
  {
    "effect": "Doubles Speed upon using or losing a held item.",
    "name": "unburden",
    "description": "Boosts the Speed stat if the Pokémon’s held item is used or lost.",
    "id": 84
  },
  {
    "effect": "Halves damage from fire moves and burns.",
    "name": "heatproof",
    "description": "The heatproof body of the Pokémon halves the damage from Fire-type moves that hit it.",
    "id": 85
  },
  {
    "effect": "Doubles the Pokémon's stat modifiers. These doubled modifiers are still capped at -6 or 6 stages.",
    "name": "simple",
    "description": "The stat changes the Pokémon receives are doubled.",
    "id": 86
  },
  {
    "effect": "Causes 1/8 max HP in damage each turn during strong sunlight, but heals for 1/8 max HP during rain. Increases damage from fire moves to 1.25×, but absorbs water moves, healing for 1/4 max HP.",
    "name": "dry-skin",
    "description": "Restores HP in rain or when hit by Water-type moves. Reduces HP in harsh sunlight, and increases the damage received from Fire-type moves.",
    "id": 87
  },
  {
    "effect": "Raises the attack stat corresponding to the opponents' weaker defense one stage upon entering battle.",
    "name": "download",
    "description": "Compares an opposing Pokémon’s Defense and Sp. Def stats before raising its own Attack or Sp. Atk stat—whichever will be more effective.",
    "id": 88
  },
  {
    "effect": "Strengthens punch-based moves to 1.2× their power.",
    "name": "iron-fist",
    "description": "Powers up punching moves.",
    "id": 89
  },
  {
    "effect": "Heals for 1/8 max HP after each turn when poisoned in place of damage.",
    "name": "poison-heal",
    "description": "Restores HP if the Pokémon is poisoned, instead of losing HP.",
    "id": 90
  },
  {
    "effect": "Increases the same-type attack bonus from 1.5× to 2×.",
    "name": "adaptability",
    "description": "Powers up moves of the same type as the Pokémon.",
    "id": 91
  },
  {
    "effect": "Extends two-to-five-hit moves and triple kick to their full length every time.",
    "name": "skill-link",
    "description": "Maximizes the number of times multi-strike moves hit.",
    "id": 92
  },
  {
    "effect": "Cures any major status ailment after each turn during rain.",
    "name": "hydration",
    "description": "Heals status conditions if it’s raining.",
    "id": 93
  },
  {
    "effect": "Increases Special Attack to 1.5× but costs 1/8 max HP after each turn during strong sunlight.",
    "name": "solar-power",
    "description": "Boosts the Sp. Atk stat in harsh sunlight, but HP decreases every turn.",
    "id": 94
  },
  {
    "effect": "Increases Speed to 1.5× with a major status ailment.",
    "name": "quick-feet",
    "description": "Boosts the Speed stat if the Pokémon has a status condition.",
    "id": 95
  },
  {
    "effect": "Makes the Pokémon's moves all act normal-type.",
    "name": "normalize",
    "description": "All the Pokémon’s moves become Normal type. The power of those moves is boosted a little.",
    "id": 96
  },
  {
    "effect": "Strengthens critical hits to inflict 3× damage rather than 2×.",
    "name": "sniper",
    "description": "Powers up moves if they become critical hits when attacking.",
    "id": 97
  },
  {
    "effect": "Protects against damage not directly caused by a move.",
    "name": "magic-guard",
    "description": "The Pokémon only takes damage from attacks.",
    "id": 98
  },
  {
    "effect": "Ensures all moves used by and against the Pokémon hit.",
    "name": "no-guard",
    "description": "The Pokémon employs no-guard tactics to ensure incoming and outgoing attacks always land.",
    "id": 99
  },
  {
    "effect": "Makes the Pokémon move last within its move's priority bracket.",
    "name": "stall",
    "description": "The Pokémon moves after all other Pokémon do.",
    "id": 100
  },
  {
    "effect": "Strengthens moves of 60 base power or less to 1.5× their power.",
    "name": "technician",
    "description": "Powers up the Pokémon’s weaker moves.",
    "id": 101
  },
  {
    "effect": "Protects against major status ailments during strong sunlight.",
    "name": "leaf-guard",
    "description": "Prevents status conditions in harsh sunlight.",
    "id": 102
  },
  {
    "effect": "Prevents the Pokémon from using its held item in battle.",
    "name": "klutz",
    "description": "The Pokémon can’t use any held items.",
    "id": 103
  },
  {
    "effect": "Bypasses targets' abilities if they could hinder or prevent a move.",
    "name": "mold-breaker",
    "description": "Moves can be used on the target regardless of its Abilities.",
    "id": 104
  },
  {
    "effect": "Raises moves' critical hit rates one stage.",
    "name": "super-luck",
    "description": "The Pokémon is so lucky that the critical-hit ratios of its moves are boosted.",
    "id": 105
  },
  {
    "effect": "Damages the attacker for 1/4 its max HP when knocked out by a contact move.",
    "name": "aftermath",
    "description": "Damages the attacker if it contacts the Pokémon with a finishing hit.",
    "id": 106
  },
  {
    "effect": "Notifies all trainers upon entering battle if an opponent has a super-effective move, self destruct, explosion, or a one-hit KO move.",
    "name": "anticipation",
    "description": "The Pokémon can sense an opposing Pokémon’s dangerous moves.",
    "id": 107
  },
  {
    "effect": "Reveals the opponents' strongest move upon entering battle.",
    "name": "forewarn",
    "description": "When it enters a battle, the Pokémon can tell one of the moves an opposing Pokémon has.",
    "id": 108
  },
  {
    "effect": "Ignores other Pokémon's stat modifiers for damage and accuracy calculation.",
    "name": "unaware",
    "description": "When attacking, the Pokémon ignores the target Pokémon’s stat changes.",
    "id": 109
  },
  {
    "effect": "Doubles damage inflicted with not-very-effective moves.",
    "name": "tinted-lens",
    "description": "The Pokémon can use “not very effective” moves to deal regular damage. ",
    "id": 110
  },
  {
    "effect": "Decreases damage taken from super-effective moves by 1/4.",
    "name": "filter",
    "description": "Reduces the power of supereffective attacks taken.",
    "id": 111
  },
  {
    "effect": "Halves Attack and Speed for five turns upon entering battle.",
    "name": "slow-start",
    "description": "For five turns, the Pokémon’s Attack and Speed stats are halved.",
    "id": 112
  },
  {
    "effect": "Lets the Pokémon's normal and fighting moves hit ghost Pokémon.",
    "name": "scrappy",
    "description": "The Pokémon can hit Ghost-type Pokémon with Normal- and Fighting-type moves.",
    "id": 113
  },
  {
    "effect": "Redirects single-target water moves to this Pokémon where possible. Absorbs Water moves, raising Special Attack one stage.",
    "name": "storm-drain",
    "description": "Draws in all Water-type moves. Instead of being hit by Water-type moves, it boosts its Sp. Atk.",
    "id": 114
  },
  {
    "effect": "Heals for 1/16 max HP after each turn during hail. Protects against hail damage.",
    "name": "ice-body",
    "description": "The Pokémon gradually regains HP in a hailstorm.",
    "id": 115
  },
  {
    "effect": "Decreases damage taken from super-effective moves by 1/4.",
    "name": "solid-rock",
    "description": "Reduces the power of supereffective attacks taken.",
    "id": 116
  },
  {
    "effect": "Summons hail that lasts indefinitely upon entering battle.",
    "name": "snow-warning",
    "description": "The Pokémon summons a hailstorm when it enters a battle.",
    "id": 117
  },
  {
    "effect": "The Pokémon may pick up honey after battle.",
    "name": "honey-gather",
    "description": "The Pokémon may gather Honey after a battle.",
    "id": 118
  },
  {
    "effect": "Reveals an opponent's held item upon entering battle.",
    "name": "frisk",
    "description": "When it enters a battle, the Pokémon can check an opposing Pokémon’s held item.",
    "id": 119
  },
  {
    "effect": "Strengthens recoil moves to 1.2× their power.",
    "name": "reckless",
    "description": "Powers up moves that have recoil damage.",
    "id": 120
  },
  {
    "effect": "Changes arceus's type and form to match its held Plate.",
    "name": "multitype",
    "description": "Changes the Pokémon’s type to match the Plate or Z-Crystal it holds.",
    "id": 121
  },
  {
    "effect": "Increases friendly Pokémon's Attack and Special Defense to 1.5× during strong sunlight.",
    "name": "flower-gift",
    "description": "Boosts the Attack and Sp. Def stats of itself and allies in harsh sunlight.",
    "id": 122
  },
  {
    "effect": "Damages sleeping opponents for 1/8 their max HP after each turn.",
    "name": "bad-dreams",
    "description": "Reduces the HP of sleeping opposing Pokémon.",
    "id": 123
  },
  {
    "effect": "Steals attacking Pokémon's held items on contact.",
    "name": "pickpocket",
    "description": "Steals an item from an attacker that made direct contact.",
    "id": 124
  },
  {
    "effect": "Strengthens moves with extra effects to 1.3× their power, but prevents their extra effects.",
    "name": "sheer-force",
    "description": "Removes additional effects to increase the power of moves when attacking.",
    "id": 125
  },
  {
    "effect": "Inverts stat changes.",
    "name": "contrary",
    "description": "Makes stat changes have an opposite effect.",
    "id": 126
  },
  {
    "effect": "Prevents opposing Pokémon from eating held Berries.",
    "name": "unnerve",
    "description": "Unnerves opposing Pokémon and makes them unable to eat Berries.",
    "id": 127
  },
  {
    "effect": "Raises Attack two stages upon having any stat lowered.",
    "name": "defiant",
    "description": "Boosts the Pokémon’s Attack stat sharply when its stats are lowered.",
    "id": 128
  },
  {
    "effect": "Halves Attack and Special Attack at 50% max HP or less.",
    "name": "defeatist",
    "description": "Halves the Pokémon’s Attack and Sp. Atk stats when its HP becomes half or less.",
    "id": 129
  },
  {
    "effect": "Has a 30% chance of Disabling any move that hits the Pokémon.",
    "name": "cursed-body",
    "description": "May disable a move used on the Pokémon.",
    "id": 130
  },
  {
    "effect": "Has a 30% chance of curing each adjacent ally of any major status ailment after each turn.",
    "name": "healer",
    "description": "Sometimes heals an ally’s status condition.",
    "id": 131
  },
  {
    "effect": "Decreases all direct damage taken by friendly Pokémon to 0.75×.",
    "name": "friend-guard",
    "description": "Reduces damage done to allies.",
    "id": 132
  },
  {
    "effect": "Raises Speed and lowers Defense by one stage each upon being hit by a physical move.",
    "name": "weak-armor",
    "description": "Physical attacks to the Pokémon lower its Defense stat but sharply raise its Speed stat.",
    "id": 133
  },
  {
    "effect": "Doubles the Pokémon's weight.",
    "name": "heavy-metal",
    "description": "Doubles the Pokémon’s weight.",
    "id": 134
  },
  {
    "effect": "Halves the Pokémon's weight.",
    "name": "light-metal",
    "description": "Halves the Pokémon’s weight.",
    "id": 135
  },
  {
    "effect": "Halves damage taken from full HP.",
    "name": "multiscale",
    "description": "Reduces the amount of damage the Pokémon takes when its HP is full.",
    "id": 136
  },
  {
    "effect": "Increases Attack to 1.5× when poisoned.",
    "name": "toxic-boost",
    "description": "Powers up physical attacks when the Pokémon is poisoned.",
    "id": 137
  },
  {
    "effect": "Increases Special Attack to 1.5× when burned.",
    "name": "flare-boost",
    "description": "Powers up special attacks when the Pokémon is burned.",
    "id": 138
  },
  {
    "effect": "Has a 50% chance of restoring a used Berry after each turn if the Pokémon has held no items in the meantime.",
    "name": "harvest",
    "description": "May create another Berry after one is used.",
    "id": 139
  },
  {
    "effect": "Protects against friendly Pokémon's damaging moves.",
    "name": "telepathy",
    "description": "Anticipates an ally’s attack and dodges it.",
    "id": 140
  },
  {
    "effect": "Raises a random stat two stages and lowers another one stage after each turn.",
    "name": "moody",
    "description": "Raises one stat sharply and lowers another every turn.",
    "id": 141
  },
  {
    "effect": "Protects against damage from weather.",
    "name": "overcoat",
    "description": "Protects the Pokémon from things like sand, hail, and powder.",
    "id": 142
  },
  {
    "effect": "Has a 30% chance of poisoning target Pokémon upon contact.",
    "name": "poison-touch",
    "description": "May poison a target when the Pokémon makes contact.",
    "id": 143
  },
  {
    "effect": "Heals for 1/3 max HP upon switching out.",
    "name": "regenerator",
    "description": "Restores a little HP when withdrawn from battle.",
    "id": 144
  },
  {
    "effect": "Protects against Defense drops.",
    "name": "big-pecks",
    "description": "Protects the Pokémon from Defense-lowering effects.",
    "id": 145
  },
  {
    "effect": "Doubles Speed during a sandstorm. Protects against sandstorm damage.",
    "name": "sand-rush",
    "description": "Boosts the Pokémon’s Speed stat in a sandstorm.",
    "id": 146
  },
  {
    "effect": "Lowers incoming non-damaging moves' base accuracy to exactly 50%.",
    "name": "wonder-skin",
    "description": "Makes status moves more likely to miss.",
    "id": 147
  },
  {
    "effect": "Strengthens moves to 1.3× their power when moving last.",
    "name": "analytic",
    "description": "Boosts move power when the Pokémon moves last.",
    "id": 148
  },
  {
    "effect": "Takes the appearance of the last conscious party Pokémon upon being sent out until hit by a damaging move.",
    "name": "illusion",
    "description": "Comes out disguised as the Pokémon in the party’s last spot.",
    "id": 149
  },
  {
    "effect": "Transforms upon entering battle.",
    "name": "imposter",
    "description": "The Pokémon transforms itself into the Pokémon it’s facing.",
    "id": 150
  },
  {
    "effect": "Bypasses light screen, reflect, and safeguard.",
    "name": "infiltrator",
    "description": "Passes through the opposing Pokémon’s barrier, substitute, and the like and strikes.",
    "id": 151
  },
  {
    "effect": "Changes attacking Pokémon's abilities to Mummy on contact.",
    "name": "mummy",
    "description": "Contact with the Pokémon changes the attacker’s Ability to Mummy.",
    "id": 152
  },
  {
    "effect": "Raises Attack one stage upon KOing a Pokémon.",
    "name": "moxie",
    "description": "The Pokémon shows moxie, and that boosts the Attack stat after knocking out any Pokémon.",
    "id": 153
  },
  {
    "effect": "Raises Attack one stage upon taking damage from a dark move.",
    "name": "justified",
    "description": "Being hit by a Dark-type move boosts the Attack stat of the Pokémon, for justice.",
    "id": 154
  },
  {
    "effect": "Raises Speed one stage upon being hit by a dark, ghost, or bug move.",
    "name": "rattled",
    "description": "Dark-, Ghost-, and Bug-type moves scare the Pokémon and boost its Speed stat.",
    "id": 155
  },
  {
    "effect": "Reflects most non-damaging moves back at their user.",
    "name": "magic-bounce",
    "description": "Reflects status moves, instead of getting hit by them.",
    "id": 156
  },
  {
    "effect": "Absorbs grass moves, raising Attack one stage.",
    "name": "sap-sipper",
    "description": "Boosts the Attack stat if hit by a Grass-type move, instead of taking damage.",
    "id": 157
  },
  {
    "effect": "Raises non-damaging moves' priority by one stage.",
    "name": "prankster",
    "description": "Gives priority to a status move.",
    "id": 158
  },
  {
    "effect": "Strengthens rock, ground, and steel moves to 1.3× their power during a sandstorm. Protects against sandstorm damage.",
    "name": "sand-force",
    "description": "Boosts the power of Rock-, Ground-, and Steel-type moves in a sandstorm.",
    "id": 159
  },
  {
    "effect": "Damages attacking Pokémon for 1/8 their max HP on contact.",
    "name": "iron-barbs",
    "description": "Inflicts damage to the attacker on contact with iron barbs.",
    "id": 160
  },
  {
    "effect": "Changes darmanitan's form after each turn depending on its HP: Zen Mode below 50% max HP, and Standard Mode otherwise.",
    "name": "zen-mode",
    "description": "Changes the Pokémon’s shape when HP is half or less.",
    "id": 161
  },
  {
    "effect": "Increases moves' accuracy to 1.1× for friendly Pokémon.",
    "name": "victory-star",
    "description": "Boosts the accuracy of its allies and itself.",
    "id": 162
  },
  {
    "effect": "Bypasses targets' abilities if they could hinder or prevent moves.",
    "name": "turboblaze",
    "description": "Moves can be used on the target regardless of its Abilities.",
    "id": 163
  },
  {
    "effect": "Bypasses targets' abilities if they could hinder or prevent moves.",
    "name": "teravolt",
    "description": "Moves can be used on the target regardless of its Abilities.",
    "id": 164
  },
  {
    "effect": "Protects allies against moves that affect their mental state.",
    "name": "aroma-veil",
    "description": "Protects itself and its allies from attacks that limit their move choices.",
    "id": 165
  },
  {
    "effect": "Protects friendly grass Pokémon from having their stats lowered by other Pokémon.",
    "name": "flower-veil",
    "description": "Ally Grass-type Pokémon are protected from status conditions and the lowering of their stats.",
    "id": 166
  },
  {
    "effect": "Restores HP upon eating a Berry, in addition to the Berry's effect.",
    "name": "cheek-pouch",
    "description": "Restores HP as well when the Pokémon eats a Berry.",
    "id": 167
  },
  {
    "effect": "Changes the bearer's type to match each move it uses.",
    "name": "protean",
    "description": "Changes the Pokémon’s type to the type of the move it’s about to use.",
    "id": 168
  },
  {
    "effect": "Halves damage from physical attacks.",
    "name": "fur-coat",
    "description": "Halves the damage from physical moves.",
    "id": 169
  },
  {
    "effect": "Steals the target's held item when the bearer uses a damaging move.",
    "name": "magician",
    "description": "The Pokémon steals the held item of a Pokémon it hits with a move.",
    "id": 170
  },
  {
    "effect": "Protects against bullet, ball, and bomb-based moves.",
    "name": "bulletproof",
    "description": "Protects the Pokémon from some ball and bomb moves.",
    "id": 171
  },
  {
    "effect": "Raises Special Attack by two stages upon having any stat lowered.",
    "name": "competitive",
    "description": "Boosts the Sp. Atk stat sharply when a stat is lowered.",
    "id": 172
  },
  {
    "effect": "Strengthens biting moves to 1.5× their power.",
    "name": "strong-jaw",
    "description": "The Pokémon’s strong jaw boosts the power of its biting moves.",
    "id": 173
  },
  {
    "effect": "Turns the bearer's normal moves into ice moves and strengthens them to 1.3× their power.",
    "name": "refrigerate",
    "description": "Normal-type moves become Ice-type moves. The power of those moves is boosted a little.",
    "id": 174
  },
  {
    "effect": "Prevents friendly Pokémon from sleeping.",
    "name": "sweet-veil",
    "description": "Prevents itself and ally Pokémon from falling asleep.",
    "id": 175
  },
  {
    "effect": "Changes aegislash to Blade Forme before using a damaging move, or Shield Forme before using kings shield.",
    "name": "stance-change",
    "description": "The Pokémon changes its form to Blade Forme when it uses an attack move, and changes to Shield Forme when it uses King’s Shield.",
    "id": 176
  },
  {
    "effect": "Raises flying moves' priority by one stage.",
    "name": "gale-wings",
    "description": "Gives priority to Flying-type moves when the  Pokémon’s HP is full.",
    "id": 177
  },
  {
    "effect": "Strengthens aura and pulse moves to 1.5× their power.",
    "name": "mega-launcher",
    "description": "Powers up aura and pulse moves.",
    "id": 178
  },
  {
    "effect": "Boosts Defense while grassy terrain is in effect.",
    "name": "grass-pelt",
    "description": "Boosts the Pokémon’s Defense stat in Grassy Terrain.",
    "id": 179
  },
  {
    "effect": "Passes the bearer's held item to an ally when the ally uses up its item.",
    "name": "symbiosis",
    "description": "The Pokémon passes its item to an ally that has used up an item.",
    "id": 180
  },
  {
    "effect": "Strengthens moves that make contact to 1.33× their power.",
    "name": "tough-claws",
    "description": "Powers up moves that make direct contact.",
    "id": 181
  },
  {
    "effect": "Turns the bearer's normal moves into fairy moves and strengthens them to 1.3× their power.",
    "name": "pixilate",
    "description": "Normal-type moves become Fairy-type moves. The power of those moves is boosted a little.",
    "id": 182
  },
  {
    "effect": "Lowers attacking Pokémon's Speed by one stage on contact.",
    "name": "gooey",
    "description": "Contact with the Pokémon lowers the attacker’s Speed stat.",
    "id": 183
  },
  {
    "effect": "Turns the bearer's normal moves into flying moves and strengthens them to 1.3× their power.",
    "name": "aerilate",
    "description": "Normal-type moves become Flying-type moves. The power of those moves is boosted a little.",
    "id": 184
  },
  {
    "effect": "Lets the bearer hit twice with damaging moves. The second hit has half power.",
    "name": "parental-bond",
    "description": "Parent and child each attacks.",
    "id": 185
  },
  {
    "effect": "Strengthens dark moves to 1.33× their power for all friendly and opposing Pokémon.",
    "name": "dark-aura",
    "description": "Powers up each Pokémon’s Dark-type moves.",
    "id": 186
  },
  {
    "effect": "Strengthens fairy moves to 1.33× their power for all friendly and opposing Pokémon.",
    "name": "fairy-aura",
    "description": "Powers up each Pokémon’s Fairy-type moves.",
    "id": 187
  },
  {
    "effect": "Makes dark aura and fairy aura weaken moves of their respective types.",
    "name": "aura-break",
    "description": "The effects of “Aura” Abilities are reversed to lower the power of affected moves.",
    "id": 188
  },
  {
    "effect": "Creates heavy rain, which has all the properties of Rain Dance, cannot be replaced, and causes damaging Fire moves to fail.",
    "name": "primordial-sea",
    "description": "The Pokémon changes the weather to nullify Fire-type attacks.",
    "id": 189
  },
  {
    "effect": "Creates extremely harsh sunlight, which has all the properties of Sunny Day, cannot be replaced, and causes damaging Water moves to fail.",
    "name": "desolate-land",
    "description": "The Pokémon changes the weather to nullify Water-type attacks.",
    "id": 190
  },
  {
    "effect": "Creates a mysterious air current, which cannot be replaced and causes moves to never be super effective against Flying Pokémon.",
    "name": "delta-stream",
    "description": "The Pokémon changes the weather to eliminate all of the Flying type’s weaknesses.",
    "id": 191
  },
  {
    "effect": "Raises this Pokémon's Defense by one stage when it takes damage from a move.",
    "name": "stamina",
    "description": "Boosts the Defense stat when hit by an attack.",
    "id": 192
  },
  {
    "effect": "This Pokémon automatically switches out when its HP drops below half.",
    "name": "wimp-out",
    "description": "The Pokémon cowardly switches out when its HP becomes half or less.",
    "id": 193
  },
  {
    "effect": "This Pokémon automatically switches out when its HP drops below half.",
    "name": "emergency-exit",
    "description": "The Pokémon, sensing danger, switches out when its HP becomes half or less.",
    "id": 194
  },
  {
    "effect": "Raises this Pokémon's Defense by two stages when it's hit by a Water move.",
    "name": "water-compaction",
    "description": "Boosts the Pokémon’s Defense stat sharply when hit by a Water-type move.",
    "id": 195
  },
  {
    "effect": "This Pokémon's moves critical hit against poisoned targets.",
    "name": "merciless",
    "description": "The Pokémon’s attacks become critical hits if the target is poisoned.",
    "id": 196
  },
  {
    "effect": "Transforms this Minior between Core Form and Meteor Form. Prevents major status ailments and drowsiness while in Meteor Form.",
    "name": "shields-down",
    "description": "When its HP becomes half or less, the Pokémon’s shell breaks and it becomes aggressive.",
    "id": 197
  },
  {
    "effect": "This Pokémon's moves have double power against Pokémon that switched in this turn.",
    "name": "stakeout",
    "description": "Doubles the damage dealt to the target’s replacement if the target switches out.",
    "id": 198
  },
  {
    "effect": "Halves damage from Fire moves, doubles damage of Water moves, and prevents burns.",
    "name": "water-bubble",
    "description": "Lowers the power of Fire-type moves done to the Pokémon and prevents the Pokémon from getting a burn.",
    "id": 199
  },
  {
    "effect": "This Pokémon's Steel moves have 1.5× power.",
    "name": "steelworker",
    "description": "Powers up Steel-type moves.",
    "id": 200
  },
  {
    "effect": "Raises this Pokémon's Special Attack by one stage every time its HP drops below half.",
    "name": "berserk",
    "description": "Boosts the Pokémon’s Sp. Atk stat when it takes a hit that causes its HP to become half or less.",
    "id": 201
  },
  {
    "effect": "During Hail, this Pokémon has double Speed.",
    "name": "slush-rush",
    "description": "Boosts the Pokémon’s Speed stat in a hailstorm.",
    "id": 202
  },
  {
    "effect": "This Pokémon's moves do not make contact.",
    "name": "long-reach",
    "description": "The Pokémon uses its moves without making contact with the target.",
    "id": 203
  },
  {
    "effect": "Sound-based moves become Water-type.",
    "name": "liquid-voice",
    "description": "All sound-based moves become Water-type moves.",
    "id": 204
  },
  {
    "effect": "This Pokémon's healing moves have their priority increased by 3.",
    "name": "triage",
    "description": "Gives priority to a healing move.",
    "id": 205
  },
  {
    "effect": "This Pokémon's Normal moves are Electric and have their power increased to 1.2×.",
    "name": "galvanize",
    "description": "Normal-type moves become Electric-type moves. The power of those moves is boosted a little.",
    "id": 206
  },
  {
    "effect": "Doubles this Pokémon's Speed on Electric Terrain.",
    "name": "surge-surfer",
    "description": "Doubles the Pokémon’s Speed stat on Electric Terrain.",
    "id": 207
  },
  {
    "effect": "Wishiwashi becomes Schooling Form when its HP is 25% or higher.",
    "name": "schooling",
    "description": "When it has a lot of HP, the Pokémon forms a powerful school. It stops schooling when its HP is low.",
    "id": 208
  },
  {
    "effect": "Prevents the first instance of battle damage.",
    "name": "disguise",
    "description": "Once per battle, the shroud that covers the Pokémon can protect it from an attack.",
    "id": 209
  },
  {
    "effect": "Transforms this Pokémon into Ash-Greninja after fainting an opponent. Water Shuriken's power is 20 and always hits three times.",
    "name": "battle-bond",
    "description": "Defeating an opposing Pokémon strengthens the Pokémon’s bond with its Trainer, and it becomes Ash-Greninja. Water Shuriken gets more powerful.",
    "id": 210
  },
  {
    "effect": "Transforms 10% or 50% Zygarde into Complete Forme when its HP is below 50%.",
    "name": "power-construct",
    "description": "Other Cells gather to aid when its HP becomes half or less. Then the Pokémon changes its form to Complete Forme.",
    "id": 211
  },
  {
    "effect": "This Pokémon can inflict poison on Poison and Steel Pokémon.",
    "name": "corrosion",
    "description": "The Pokémon can poison the target even if it’s a Steel or Poison type.",
    "id": 212
  },
  {
    "effect": "This Pokémon always acts as though it were Asleep.",
    "name": "comatose",
    "description": "It’s always drowsing and will never wake up. It can attack without waking up.",
    "id": 213
  },
  {
    "effect": "Opposing Pokémon cannot use priority attacks.",
    "name": "queenly-majesty",
    "description": "Its majesty pressures the opposing Pokémon, making it unable to attack using priority moves.",
    "id": 214
  },
  {
    "effect": "When this Pokémon faints from an opponent's move, that opponent takes damage equal to the HP this Pokémon had remaining.",
    "name": "innards-out",
    "description": "Damages the attacker landing the finishing hit by the amount equal to its last HP.",
    "id": 215
  },
  {
    "effect": "Whenever another Pokémon uses a dance move, this Pokémon will use the same move immediately afterwards.",
    "name": "dancer",
    "description": "When another Pokémon uses a dance move, it can use a dance move following it regardless of its Speed.",
    "id": 216
  },
  {
    "effect": "Ally Pokémon's moves have their power increased to 1.3×.",
    "name": "battery",
    "description": "Powers up ally Pokémon’s special moves.",
    "id": 217
  },
  {
    "effect": "Damage from contact moves is halved. Damage from Fire moves is doubled.",
    "name": "fluffy",
    "description": "Halves the damage taken from moves that make direct contact, but doubles that of Fire-type moves.",
    "id": 218
  },
  {
    "effect": "Opposing Pokémon cannot use priority attacks.",
    "name": "dazzling",
    "description": "Surprises the opposing Pokémon, making it unable to attack using priority moves.",
    "id": 219
  },
  {
    "effect": "This Pokémon's Special Attack rises by one stage every time any Pokémon faints.",
    "name": "soul-heart",
    "description": "Boosts its Sp. Atk stat every time a Pokémon faints.",
    "id": 220
  },
  {
    "effect": "When this Pokémon takes regular damage from a contact move, the attacking Pokémon's Speed lowers by one stage.",
    "name": "tangling-hair",
    "description": "Contact with the Pokémon lowers the attacker’s Speed stat.",
    "id": 221
  },
  {
    "effect": "When an ally faints, this Pokémon gains its Ability.",
    "name": "receiver",
    "description": "The Pokémon copies the Ability of a defeated ally.",
    "id": 222
  },
  {
    "effect": "When an ally faints, this Pokémon gains its Ability.",
    "name": "power-of-alchemy",
    "description": "The Pokémon copies the Ability of a defeated ally.",
    "id": 223
  },
  {
    "effect": "Raises this Pokémon's highest stat by one stage when it faints another Pokémon.",
    "name": "beast-boost",
    "description": "The Pokémon boosts its most proficient stat each time it knocks out a Pokémon.",
    "id": 224
  },
  {
    "effect": "Changes this Pokémon's type to match its held Memory.",
    "name": "rks-system",
    "description": "Changes the Pokémon’s type to match the memory disc it holds.",
    "id": 225
  },
  {
    "effect": "When this Pokémon enters battle, it changes the terrain to Electric Terrain.",
    "name": "electric-surge",
    "description": "Turns the ground into Electric Terrain when the Pokémon enters a battle.",
    "id": 226
  },
  {
    "effect": "When this Pokémon enters battle, it changes the terrain to Psychic Terrain.",
    "name": "psychic-surge",
    "description": "Turns the ground into Psychic Terrain when the Pokémon enters a battle.",
    "id": 227
  },
  {
    "effect": "When this Pokémon enters battle, it changes the terrain to Misty Terrain.",
    "name": "misty-surge",
    "description": "Turns the ground into Misty Terrain when the Pokémon enters a battle.",
    "id": 228
  },
  {
    "effect": "When this Pokémon enters battle, it changes the terrain to Grassy Terrain.",
    "name": "grassy-surge",
    "description": "Turns the ground into Grassy Terrain when the Pokémon enters a battle.",
    "id": 229
  },
  {
    "effect": "Other Pokémon cannot lower this Pokémon's stats.",
    "name": "full-metal-body",
    "description": "Prevents other Pokémon’s moves or Abilities from lowering the Pokémon’s stats.",
    "id": 230
  },
  {
    "effect": "When this Pokémon has full HP, regular damage from moves is halved.",
    "name": "shadow-shield",
    "description": "Reduces the amount of damage the Pokémon takes while its HP is full.",
    "id": 231
  },
  {
    "effect": "Reduces super-effective damage to 0.75×.",
    "name": "prism-armor",
    "description": "Reduces the power of supereffective attacks taken.",
    "id": 232
  },
  {
    "effect": "Increases super-effective damage dealt to 1.25×.",
    "name": "neuroforce",
    "description": "Powers up moves that are super effective.",
    "id": 233
  }, {}
]
